func.func @main(%592 : tensor<784x512xf32>, %591 : tensor<784x512xf32>, %590 : tensor<1x512xf32>, %589 : tensor<1x512xf32>, %588 : tensor<512x16xf32>, %587 : tensor<512x16xf32>, %586 : tensor<1x16xf32>, %585 : tensor<1x16xf32>, %584 : tensor<512x16xf32>, %583 : tensor<512x16xf32>, %582 : tensor<1x16xf32>, %581 : tensor<1x16xf32>, %580 : tensor<16x512xf32>, %579 : tensor<16x512xf32>, %578 : tensor<1x512xf32>, %577 : tensor<1x512xf32>, %576 : tensor<512x784xf32>, %575 : tensor<512x784xf32>, %574 : tensor<1x784xf32>, %573 : tensor<1x784xf32>, %572 : tensor<f32>, %571 : tensor<784x512xf32>, %570 : tensor<784x512xf32>, %569 : tensor<1x512xf32>, %568 : tensor<1x512xf32>, %567 : tensor<512x16xf32>, %566 : tensor<512x16xf32>, %565 : tensor<1x16xf32>, %564 : tensor<1x16xf32>, %563 : tensor<512x16xf32>, %562 : tensor<512x16xf32>, %561 : tensor<1x16xf32>, %560 : tensor<1x16xf32>, %559 : tensor<16x512xf32>, %558 : tensor<16x512xf32>, %557 : tensor<1x512xf32>, %556 : tensor<1x512xf32>, %555 : tensor<512x784xf32>, %554 : tensor<512x784xf32>, %553 : tensor<1x784xf32>, %552 : tensor<1x784xf32>, %551 : tensor<784x512xf32>, %550 : tensor<784x512xf32>, %549 : tensor<1x512xf32>, %548 : tensor<1x512xf32>, %547 : tensor<512x16xf32>, %546 : tensor<512x16xf32>, %545 : tensor<1x16xf32>, %544 : tensor<1x16xf32>, %543 : tensor<512x16xf32>, %542 : tensor<512x16xf32>, %541 : tensor<1x16xf32>, %540 : tensor<1x16xf32>, %539 : tensor<16x512xf32>, %538 : tensor<16x512xf32>, %537 : tensor<1x512xf32>, %536 : tensor<1x512xf32>, %535 : tensor<512x784xf32>, %534 : tensor<512x784xf32>, %533 : tensor<1x784xf32>, %532 : tensor<1x784xf32>, %531 : tensor<128x1x784xf32>, %530 : tensor<ui64>) -> (tensor<f32>, tensor<784x512xf32>, tensor<784x512xf32>, tensor<1x512xf32>, tensor<1x512xf32>, tensor<512x16xf32>, tensor<512x16xf32>, tensor<1x16xf32>, tensor<1x16xf32>, tensor<512x16xf32>, tensor<512x16xf32>, tensor<1x16xf32>, tensor<1x16xf32>, tensor<16x512xf32>, tensor<16x512xf32>, tensor<1x512xf32>, tensor<1x512xf32>, tensor<512x784xf32>, tensor<512x784xf32>, tensor<1x784xf32>, tensor<1x784xf32>, tensor<f32>, tensor<784x512xf32>, tensor<784x512xf32>, tensor<1x512xf32>, tensor<1x512xf32>, tensor<512x16xf32>, tensor<512x16xf32>, tensor<1x16xf32>, tensor<1x16xf32>, tensor<512x16xf32>, tensor<512x16xf32>, tensor<1x16xf32>, tensor<1x16xf32>, tensor<16x512xf32>, tensor<16x512xf32>, tensor<1x512xf32>, tensor<1x512xf32>, tensor<512x784xf32>, tensor<512x784xf32>, tensor<1x784xf32>, tensor<1x784xf32>, tensor<784x512xf32>, tensor<784x512xf32>, tensor<1x512xf32>, tensor<1x512xf32>, tensor<512x16xf32>, tensor<512x16xf32>, tensor<1x16xf32>, tensor<1x16xf32>, tensor<512x16xf32>, tensor<512x16xf32>, tensor<1x16xf32>, tensor<1x16xf32>, tensor<16x512xf32>, tensor<16x512xf32>, tensor<1x512xf32>, tensor<1x512xf32>, tensor<512x784xf32>, tensor<512x784xf32>, tensor<1x784xf32>, tensor<1x784xf32>, tensor<ui64>) {
%1447 = "stablehlo.constant"() {
value = dense<1.000000e+00> : tensor<128x1x784xf32>
} : () -> (tensor<128x1x784xf32>)
%1448 = "stablehlo.constant"() {
value = dense<-1.000000e+00> : tensor<128x1x784xf32>
} : () -> (tensor<128x1x784xf32>)
%1453 = "stablehlo.broadcast_in_dim"(%592) {
broadcast_dimensions = array<i64: 1,2>
} : (tensor<784x512xf32>) -> (tensor<128x784x512xf32>)
%1454 = "stablehlo.constant"() {
value = dense<0.000000e+00> : tensor<128x784x512xf32>
} : () -> (tensor<128x784x512xf32>)
%1455 = "stablehlo.broadcast_in_dim"(%591) {
broadcast_dimensions = array<i64: 1,2>
} : (tensor<784x512xf32>) -> (tensor<128x784x512xf32>)
%1456 = "stablehlo.multiply"(%1454, %1455) : (tensor<128x784x512xf32>, tensor<128x784x512xf32>) -> (tensor<128x784x512xf32>)
%1457 = "stablehlo.add"(%1453, %1456) : (tensor<128x784x512xf32>, tensor<128x784x512xf32>) -> (tensor<128x784x512xf32>)
%1452 = "stablehlo.dot_general"(%531, %1457) {
dot_dimension_numbers = #stablehlo.dot<
lhs_batching_dimensions = [0],
rhs_batching_dimensions = [0],
lhs_contracting_dimensions = [2],
rhs_contracting_dimensions = [1]
>
} : (tensor<128x1x784xf32>, tensor<128x784x512xf32>) -> (tensor<128x1x512xf32>)
%1458 = "stablehlo.broadcast_in_dim"(%590) {
broadcast_dimensions = array<i64: 1,2>
} : (tensor<1x512xf32>) -> (tensor<128x1x512xf32>)
%1459 = "stablehlo.constant"() {
value = dense<0.000000e+00> : tensor<128x1x512xf32>
} : () -> (tensor<128x1x512xf32>)
%1460 = "stablehlo.broadcast_in_dim"(%589) {
broadcast_dimensions = array<i64: 1,2>
} : (tensor<1x512xf32>) -> (tensor<128x1x512xf32>)
%1461 = "stablehlo.multiply"(%1459, %1460) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1462 = "stablehlo.add"(%1458, %1461) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1463 = "stablehlo.add"(%1452, %1462) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1464 = "stablehlo.tanh"(%1463) : (tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1465 = "stablehlo.broadcast_in_dim"(%588) {
broadcast_dimensions = array<i64: 1,2>
} : (tensor<512x16xf32>) -> (tensor<128x512x16xf32>)
%1466 = "stablehlo.constant"() {
value = dense<0.000000e+00> : tensor<128x512x16xf32>
} : () -> (tensor<128x512x16xf32>)
%1467 = "stablehlo.broadcast_in_dim"(%587) {
broadcast_dimensions = array<i64: 1,2>
} : (tensor<512x16xf32>) -> (tensor<128x512x16xf32>)
%1468 = "stablehlo.multiply"(%1466, %1467) : (tensor<128x512x16xf32>, tensor<128x512x16xf32>) -> (tensor<128x512x16xf32>)
%1469 = "stablehlo.add"(%1465, %1468) : (tensor<128x512x16xf32>, tensor<128x512x16xf32>) -> (tensor<128x512x16xf32>)
%1451 = "stablehlo.dot_general"(%1464, %1469) {
dot_dimension_numbers = #stablehlo.dot<
lhs_batching_dimensions = [0],
rhs_batching_dimensions = [0],
lhs_contracting_dimensions = [2],
rhs_contracting_dimensions = [1]
>
} : (tensor<128x1x512xf32>, tensor<128x512x16xf32>) -> (tensor<128x1x16xf32>)
%1470 = "stablehlo.broadcast_in_dim"(%586) {
broadcast_dimensions = array<i64: 1,2>
} : (tensor<1x16xf32>) -> (tensor<128x1x16xf32>)
%1471 = "stablehlo.constant"() {
value = dense<0.000000e+00> : tensor<128x1x16xf32>
} : () -> (tensor<128x1x16xf32>)
%1472 = "stablehlo.broadcast_in_dim"(%585) {
broadcast_dimensions = array<i64: 1,2>
} : (tensor<1x16xf32>) -> (tensor<128x1x16xf32>)
%1473 = "stablehlo.multiply"(%1471, %1472) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1474 = "stablehlo.add"(%1470, %1473) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1475 = "stablehlo.add"(%1451, %1474) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1477 = "stablehlo.broadcast_in_dim"(%584) {
broadcast_dimensions = array<i64: 1,2>
} : (tensor<512x16xf32>) -> (tensor<128x512x16xf32>)
%1478 = "stablehlo.broadcast_in_dim"(%583) {
broadcast_dimensions = array<i64: 1,2>
} : (tensor<512x16xf32>) -> (tensor<128x512x16xf32>)
%1479 = "stablehlo.multiply"(%1466, %1478) : (tensor<128x512x16xf32>, tensor<128x512x16xf32>) -> (tensor<128x512x16xf32>)
%1480 = "stablehlo.add"(%1477, %1479) : (tensor<128x512x16xf32>, tensor<128x512x16xf32>) -> (tensor<128x512x16xf32>)
%1476 = "stablehlo.dot_general"(%1464, %1480) {
dot_dimension_numbers = #stablehlo.dot<
lhs_batching_dimensions = [0],
rhs_batching_dimensions = [0],
lhs_contracting_dimensions = [2],
rhs_contracting_dimensions = [1]
>
} : (tensor<128x1x512xf32>, tensor<128x512x16xf32>) -> (tensor<128x1x16xf32>)
%1481 = "stablehlo.broadcast_in_dim"(%582) {
broadcast_dimensions = array<i64: 1,2>
} : (tensor<1x16xf32>) -> (tensor<128x1x16xf32>)
%1482 = "stablehlo.broadcast_in_dim"(%581) {
broadcast_dimensions = array<i64: 1,2>
} : (tensor<1x16xf32>) -> (tensor<128x1x16xf32>)
%1483 = "stablehlo.multiply"(%1471, %1482) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1484 = "stablehlo.add"(%1481, %1483) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1485 = "stablehlo.add"(%1476, %1484) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1486 = "stablehlo.exponential"(%1485) : (tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1487 = "stablehlo.multiply"(%1471, %1486) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1488 = "stablehlo.add"(%1475, %1487) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1489 = "stablehlo.broadcast_in_dim"(%580) {
broadcast_dimensions = array<i64: 1,2>
} : (tensor<16x512xf32>) -> (tensor<128x16x512xf32>)
%1490 = "stablehlo.constant"() {
value = dense<0.000000e+00> : tensor<128x16x512xf32>
} : () -> (tensor<128x16x512xf32>)
%1491 = "stablehlo.broadcast_in_dim"(%579) {
broadcast_dimensions = array<i64: 1,2>
} : (tensor<16x512xf32>) -> (tensor<128x16x512xf32>)
%1492 = "stablehlo.multiply"(%1490, %1491) : (tensor<128x16x512xf32>, tensor<128x16x512xf32>) -> (tensor<128x16x512xf32>)
%1493 = "stablehlo.add"(%1489, %1492) : (tensor<128x16x512xf32>, tensor<128x16x512xf32>) -> (tensor<128x16x512xf32>)
%1450 = "stablehlo.dot_general"(%1488, %1493) {
dot_dimension_numbers = #stablehlo.dot<
lhs_batching_dimensions = [0],
rhs_batching_dimensions = [0],
lhs_contracting_dimensions = [2],
rhs_contracting_dimensions = [1]
>
} : (tensor<128x1x16xf32>, tensor<128x16x512xf32>) -> (tensor<128x1x512xf32>)
%1494 = "stablehlo.broadcast_in_dim"(%578) {
broadcast_dimensions = array<i64: 1,2>
} : (tensor<1x512xf32>) -> (tensor<128x1x512xf32>)
%1495 = "stablehlo.broadcast_in_dim"(%577) {
broadcast_dimensions = array<i64: 1,2>
} : (tensor<1x512xf32>) -> (tensor<128x1x512xf32>)
%1496 = "stablehlo.multiply"(%1459, %1495) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1497 = "stablehlo.add"(%1494, %1496) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1498 = "stablehlo.add"(%1450, %1497) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1499 = "stablehlo.tanh"(%1498) : (tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1500 = "stablehlo.broadcast_in_dim"(%576) {
broadcast_dimensions = array<i64: 1,2>
} : (tensor<512x784xf32>) -> (tensor<128x512x784xf32>)
%1501 = "stablehlo.constant"() {
value = dense<0.000000e+00> : tensor<128x512x784xf32>
} : () -> (tensor<128x512x784xf32>)
%1502 = "stablehlo.broadcast_in_dim"(%575) {
broadcast_dimensions = array<i64: 1,2>
} : (tensor<512x784xf32>) -> (tensor<128x512x784xf32>)
%1503 = "stablehlo.multiply"(%1501, %1502) : (tensor<128x512x784xf32>, tensor<128x512x784xf32>) -> (tensor<128x512x784xf32>)
%1504 = "stablehlo.add"(%1500, %1503) : (tensor<128x512x784xf32>, tensor<128x512x784xf32>) -> (tensor<128x512x784xf32>)
%1449 = "stablehlo.dot_general"(%1499, %1504) {
dot_dimension_numbers = #stablehlo.dot<
lhs_batching_dimensions = [0],
rhs_batching_dimensions = [0],
lhs_contracting_dimensions = [2],
rhs_contracting_dimensions = [1]
>
} : (tensor<128x1x512xf32>, tensor<128x512x784xf32>) -> (tensor<128x1x784xf32>)
%1505 = "stablehlo.broadcast_in_dim"(%574) {
broadcast_dimensions = array<i64: 1,2>
} : (tensor<1x784xf32>) -> (tensor<128x1x784xf32>)
%1506 = "stablehlo.constant"() {
value = dense<0.000000e+00> : tensor<128x1x784xf32>
} : () -> (tensor<128x1x784xf32>)
%1507 = "stablehlo.broadcast_in_dim"(%573) {
broadcast_dimensions = array<i64: 1,2>
} : (tensor<1x784xf32>) -> (tensor<128x1x784xf32>)
%1508 = "stablehlo.multiply"(%1506, %1507) : (tensor<128x1x784xf32>, tensor<128x1x784xf32>) -> (tensor<128x1x784xf32>)
%1509 = "stablehlo.add"(%1505, %1508) : (tensor<128x1x784xf32>, tensor<128x1x784xf32>) -> (tensor<128x1x784xf32>)
%1510 = "stablehlo.add"(%1449, %1509) : (tensor<128x1x784xf32>, tensor<128x1x784xf32>) -> (tensor<128x1x784xf32>)
%1511 = "stablehlo.multiply"(%1448, %1510) : (tensor<128x1x784xf32>, tensor<128x1x784xf32>) -> (tensor<128x1x784xf32>)
%1512 = "stablehlo.exponential"(%1511) : (tensor<128x1x784xf32>) -> (tensor<128x1x784xf32>)
%1513 = "stablehlo.add"(%1447, %1512) : (tensor<128x1x784xf32>, tensor<128x1x784xf32>) -> (tensor<128x1x784xf32>)
%1514 = "stablehlo.divide"(%1447, %1513) : (tensor<128x1x784xf32>, tensor<128x1x784xf32>) -> (tensor<128x1x784xf32>)
%1515 = "stablehlo.subtract"(%531, %1514) : (tensor<128x1x784xf32>, tensor<128x1x784xf32>) -> (tensor<128x1x784xf32>)
%1516 = "stablehlo.multiply"(%1515, %1515) : (tensor<128x1x784xf32>, tensor<128x1x784xf32>) -> (tensor<128x1x784xf32>)
%1517 = "stablehlo.constant"() {
value = dense<0.000000e+00> : tensor<f32>
} : () -> (tensor<f32>)
%1518 = "stablehlo.reduce"(%1516, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0>
} : (tensor<128x1x784xf32>, tensor<f32>) -> (tensor<1x784xf32>)
%1519 = "stablehlo.constant"() {
value = dense<1.280000e+02> : tensor<1x784xf32>
} : () -> (tensor<1x784xf32>)
%1520 = "stablehlo.divide"(%1518, %1519) : (tensor<1x784xf32>, tensor<1x784xf32>) -> (tensor<1x784xf32>)
%1521 = "stablehlo.reduce"(%1520, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0,1>
} : (tensor<1x784xf32>, tensor<f32>) -> (tensor<f32>)
%1522 = "stablehlo.constant"() {
value = dense<-5.000000e-01> : tensor<128x1x16xf32>
} : () -> (tensor<128x1x16xf32>)
%1523 = "stablehlo.constant"() {
value = dense<1.000000e+00> : tensor<128x1x16xf32>
} : () -> (tensor<128x1x16xf32>)
%1524 = "stablehlo.add"(%1523, %1485) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1525 = "stablehlo.multiply"(%1475, %1475) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1526 = "stablehlo.subtract"(%1524, %1525) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1527 = "stablehlo.subtract"(%1526, %1486) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1528 = "stablehlo.multiply"(%1522, %1527) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1529 = "stablehlo.reduce"(%1528, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0,1>
} : (tensor<128x1x16xf32>, tensor<f32>) -> (tensor<16xf32>)
%1530 = "stablehlo.constant"() {
value = dense<1.280000e+02> : tensor<16xf32>
} : () -> (tensor<16xf32>)
%1531 = "stablehlo.divide"(%1529, %1530) : (tensor<16xf32>, tensor<16xf32>) -> (tensor<16xf32>)
%1532 = "stablehlo.reduce"(%1531, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0>
} : (tensor<16xf32>, tensor<f32>) -> (tensor<f32>)
%1533 = "stablehlo.add"(%1521, %1532) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
%1534 = "stablehlo.constant"() {
value = dense<-5.000000e-01> : tensor<128x784x512xf32>
} : () -> (tensor<128x784x512xf32>)
%1535 = "stablehlo.constant"() {
value = dense<1.000000e+00> : tensor<128x784x512xf32>
} : () -> (tensor<128x784x512xf32>)
%1536 = "stablehlo.constant"() {
value = dense<1.000000e+03> : tensor<128x784x512xf32>
} : () -> (tensor<128x784x512xf32>)
%1537 = "stablehlo.multiply"(%1455, %1536) : (tensor<128x784x512xf32>, tensor<128x784x512xf32>) -> (tensor<128x784x512xf32>)
%1538 = "stablehlo.log"(%1537) : (tensor<128x784x512xf32>) -> (tensor<128x784x512xf32>)
%1539 = "stablehlo.add"(%1535, %1538) : (tensor<128x784x512xf32>, tensor<128x784x512xf32>) -> (tensor<128x784x512xf32>)
%1540 = "stablehlo.multiply"(%1453, %1453) : (tensor<128x784x512xf32>, tensor<128x784x512xf32>) -> (tensor<128x784x512xf32>)
%1541 = "stablehlo.subtract"(%1539, %1540) : (tensor<128x784x512xf32>, tensor<128x784x512xf32>) -> (tensor<128x784x512xf32>)
%1542 = "stablehlo.subtract"(%1541, %1537) : (tensor<128x784x512xf32>, tensor<128x784x512xf32>) -> (tensor<128x784x512xf32>)
%1543 = "stablehlo.multiply"(%1534, %1542) : (tensor<128x784x512xf32>, tensor<128x784x512xf32>) -> (tensor<128x784x512xf32>)
%1544 = "stablehlo.reduce"(%1543, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0,1>
} : (tensor<128x784x512xf32>, tensor<f32>) -> (tensor<512xf32>)
%1545 = "stablehlo.constant"() {
value = dense<1.003520e+05> : tensor<512xf32>
} : () -> (tensor<512xf32>)
%1546 = "stablehlo.divide"(%1544, %1545) : (tensor<512xf32>, tensor<512xf32>) -> (tensor<512xf32>)
%1547 = "stablehlo.reduce"(%1546, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0>
} : (tensor<512xf32>, tensor<f32>) -> (tensor<f32>)
%1548 = "stablehlo.constant"() {
value = dense<-5.000000e-01> : tensor<128x1x512xf32>
} : () -> (tensor<128x1x512xf32>)
%1549 = "stablehlo.constant"() {
value = dense<1.000000e+00> : tensor<128x1x512xf32>
} : () -> (tensor<128x1x512xf32>)
%1550 = "stablehlo.constant"() {
value = dense<1.000000e+03> : tensor<128x1x512xf32>
} : () -> (tensor<128x1x512xf32>)
%1551 = "stablehlo.multiply"(%1460, %1550) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1552 = "stablehlo.log"(%1551) : (tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1553 = "stablehlo.add"(%1549, %1552) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1554 = "stablehlo.multiply"(%1458, %1458) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1555 = "stablehlo.subtract"(%1553, %1554) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1556 = "stablehlo.subtract"(%1555, %1551) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1557 = "stablehlo.multiply"(%1548, %1556) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1558 = "stablehlo.reduce"(%1557, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0,1>
} : (tensor<128x1x512xf32>, tensor<f32>) -> (tensor<512xf32>)
%1559 = "stablehlo.constant"() {
value = dense<1.280000e+02> : tensor<512xf32>
} : () -> (tensor<512xf32>)
%1560 = "stablehlo.divide"(%1558, %1559) : (tensor<512xf32>, tensor<512xf32>) -> (tensor<512xf32>)
%1561 = "stablehlo.reduce"(%1560, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0>
} : (tensor<512xf32>, tensor<f32>) -> (tensor<f32>)
%1562 = "stablehlo.add"(%1547, %1561) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
%1563 = "stablehlo.constant"() {
value = dense<-5.000000e-01> : tensor<128x512x16xf32>
} : () -> (tensor<128x512x16xf32>)
%1564 = "stablehlo.constant"() {
value = dense<1.000000e+00> : tensor<128x512x16xf32>
} : () -> (tensor<128x512x16xf32>)
%1565 = "stablehlo.constant"() {
value = dense<1.000000e+03> : tensor<128x512x16xf32>
} : () -> (tensor<128x512x16xf32>)
%1566 = "stablehlo.multiply"(%1467, %1565) : (tensor<128x512x16xf32>, tensor<128x512x16xf32>) -> (tensor<128x512x16xf32>)
%1567 = "stablehlo.log"(%1566) : (tensor<128x512x16xf32>) -> (tensor<128x512x16xf32>)
%1568 = "stablehlo.add"(%1564, %1567) : (tensor<128x512x16xf32>, tensor<128x512x16xf32>) -> (tensor<128x512x16xf32>)
%1569 = "stablehlo.multiply"(%1465, %1465) : (tensor<128x512x16xf32>, tensor<128x512x16xf32>) -> (tensor<128x512x16xf32>)
%1570 = "stablehlo.subtract"(%1568, %1569) : (tensor<128x512x16xf32>, tensor<128x512x16xf32>) -> (tensor<128x512x16xf32>)
%1571 = "stablehlo.subtract"(%1570, %1566) : (tensor<128x512x16xf32>, tensor<128x512x16xf32>) -> (tensor<128x512x16xf32>)
%1572 = "stablehlo.multiply"(%1563, %1571) : (tensor<128x512x16xf32>, tensor<128x512x16xf32>) -> (tensor<128x512x16xf32>)
%1573 = "stablehlo.reduce"(%1572, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0,1>
} : (tensor<128x512x16xf32>, tensor<f32>) -> (tensor<16xf32>)
%1574 = "stablehlo.constant"() {
value = dense<6.553600e+04> : tensor<16xf32>
} : () -> (tensor<16xf32>)
%1575 = "stablehlo.divide"(%1573, %1574) : (tensor<16xf32>, tensor<16xf32>) -> (tensor<16xf32>)
%1576 = "stablehlo.reduce"(%1575, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0>
} : (tensor<16xf32>, tensor<f32>) -> (tensor<f32>)
%1577 = "stablehlo.constant"() {
value = dense<1.000000e+03> : tensor<128x1x16xf32>
} : () -> (tensor<128x1x16xf32>)
%1578 = "stablehlo.multiply"(%1472, %1577) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1579 = "stablehlo.log"(%1578) : (tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1580 = "stablehlo.add"(%1523, %1579) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1581 = "stablehlo.multiply"(%1470, %1470) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1582 = "stablehlo.subtract"(%1580, %1581) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1583 = "stablehlo.subtract"(%1582, %1578) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1584 = "stablehlo.multiply"(%1522, %1583) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1585 = "stablehlo.reduce"(%1584, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0,1>
} : (tensor<128x1x16xf32>, tensor<f32>) -> (tensor<16xf32>)
%1586 = "stablehlo.divide"(%1585, %1530) : (tensor<16xf32>, tensor<16xf32>) -> (tensor<16xf32>)
%1587 = "stablehlo.reduce"(%1586, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0>
} : (tensor<16xf32>, tensor<f32>) -> (tensor<f32>)
%1588 = "stablehlo.add"(%1576, %1587) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
%1589 = "stablehlo.add"(%1562, %1588) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
%1590 = "stablehlo.multiply"(%1478, %1565) : (tensor<128x512x16xf32>, tensor<128x512x16xf32>) -> (tensor<128x512x16xf32>)
%1591 = "stablehlo.log"(%1590) : (tensor<128x512x16xf32>) -> (tensor<128x512x16xf32>)
%1592 = "stablehlo.add"(%1564, %1591) : (tensor<128x512x16xf32>, tensor<128x512x16xf32>) -> (tensor<128x512x16xf32>)
%1593 = "stablehlo.multiply"(%1477, %1477) : (tensor<128x512x16xf32>, tensor<128x512x16xf32>) -> (tensor<128x512x16xf32>)
%1594 = "stablehlo.subtract"(%1592, %1593) : (tensor<128x512x16xf32>, tensor<128x512x16xf32>) -> (tensor<128x512x16xf32>)
%1595 = "stablehlo.subtract"(%1594, %1590) : (tensor<128x512x16xf32>, tensor<128x512x16xf32>) -> (tensor<128x512x16xf32>)
%1596 = "stablehlo.multiply"(%1563, %1595) : (tensor<128x512x16xf32>, tensor<128x512x16xf32>) -> (tensor<128x512x16xf32>)
%1597 = "stablehlo.reduce"(%1596, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0,1>
} : (tensor<128x512x16xf32>, tensor<f32>) -> (tensor<16xf32>)
%1598 = "stablehlo.divide"(%1597, %1574) : (tensor<16xf32>, tensor<16xf32>) -> (tensor<16xf32>)
%1599 = "stablehlo.reduce"(%1598, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0>
} : (tensor<16xf32>, tensor<f32>) -> (tensor<f32>)
%1600 = "stablehlo.multiply"(%1482, %1577) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1601 = "stablehlo.log"(%1600) : (tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1602 = "stablehlo.add"(%1523, %1601) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1603 = "stablehlo.multiply"(%1481, %1481) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1604 = "stablehlo.subtract"(%1602, %1603) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1605 = "stablehlo.subtract"(%1604, %1600) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1606 = "stablehlo.multiply"(%1522, %1605) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1607 = "stablehlo.reduce"(%1606, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0,1>
} : (tensor<128x1x16xf32>, tensor<f32>) -> (tensor<16xf32>)
%1608 = "stablehlo.divide"(%1607, %1530) : (tensor<16xf32>, tensor<16xf32>) -> (tensor<16xf32>)
%1609 = "stablehlo.reduce"(%1608, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0>
} : (tensor<16xf32>, tensor<f32>) -> (tensor<f32>)
%1610 = "stablehlo.add"(%1599, %1609) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
%1611 = "stablehlo.add"(%1589, %1610) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
%1612 = "stablehlo.add"(%1533, %1611) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
%1613 = "stablehlo.constant"() {
value = dense<-5.000000e-01> : tensor<128x16x512xf32>
} : () -> (tensor<128x16x512xf32>)
%1614 = "stablehlo.constant"() {
value = dense<1.000000e+00> : tensor<128x16x512xf32>
} : () -> (tensor<128x16x512xf32>)
%1615 = "stablehlo.constant"() {
value = dense<1.000000e+03> : tensor<128x16x512xf32>
} : () -> (tensor<128x16x512xf32>)
%1616 = "stablehlo.multiply"(%1491, %1615) : (tensor<128x16x512xf32>, tensor<128x16x512xf32>) -> (tensor<128x16x512xf32>)
%1617 = "stablehlo.log"(%1616) : (tensor<128x16x512xf32>) -> (tensor<128x16x512xf32>)
%1618 = "stablehlo.add"(%1614, %1617) : (tensor<128x16x512xf32>, tensor<128x16x512xf32>) -> (tensor<128x16x512xf32>)
%1619 = "stablehlo.multiply"(%1489, %1489) : (tensor<128x16x512xf32>, tensor<128x16x512xf32>) -> (tensor<128x16x512xf32>)
%1620 = "stablehlo.subtract"(%1618, %1619) : (tensor<128x16x512xf32>, tensor<128x16x512xf32>) -> (tensor<128x16x512xf32>)
%1621 = "stablehlo.subtract"(%1620, %1616) : (tensor<128x16x512xf32>, tensor<128x16x512xf32>) -> (tensor<128x16x512xf32>)
%1622 = "stablehlo.multiply"(%1613, %1621) : (tensor<128x16x512xf32>, tensor<128x16x512xf32>) -> (tensor<128x16x512xf32>)
%1623 = "stablehlo.reduce"(%1622, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0,1>
} : (tensor<128x16x512xf32>, tensor<f32>) -> (tensor<512xf32>)
%1624 = "stablehlo.constant"() {
value = dense<2.048000e+03> : tensor<512xf32>
} : () -> (tensor<512xf32>)
%1625 = "stablehlo.divide"(%1623, %1624) : (tensor<512xf32>, tensor<512xf32>) -> (tensor<512xf32>)
%1626 = "stablehlo.reduce"(%1625, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0>
} : (tensor<512xf32>, tensor<f32>) -> (tensor<f32>)
%1627 = "stablehlo.multiply"(%1495, %1550) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1628 = "stablehlo.log"(%1627) : (tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1629 = "stablehlo.add"(%1549, %1628) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1630 = "stablehlo.multiply"(%1494, %1494) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1631 = "stablehlo.subtract"(%1629, %1630) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1632 = "stablehlo.subtract"(%1631, %1627) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1633 = "stablehlo.multiply"(%1548, %1632) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1634 = "stablehlo.reduce"(%1633, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0,1>
} : (tensor<128x1x512xf32>, tensor<f32>) -> (tensor<512xf32>)
%1635 = "stablehlo.divide"(%1634, %1559) : (tensor<512xf32>, tensor<512xf32>) -> (tensor<512xf32>)
%1636 = "stablehlo.reduce"(%1635, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0>
} : (tensor<512xf32>, tensor<f32>) -> (tensor<f32>)
%1637 = "stablehlo.add"(%1626, %1636) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
%1638 = "stablehlo.constant"() {
value = dense<-5.000000e-01> : tensor<128x512x784xf32>
} : () -> (tensor<128x512x784xf32>)
%1639 = "stablehlo.constant"() {
value = dense<1.000000e+00> : tensor<128x512x784xf32>
} : () -> (tensor<128x512x784xf32>)
%1640 = "stablehlo.constant"() {
value = dense<1.000000e+03> : tensor<128x512x784xf32>
} : () -> (tensor<128x512x784xf32>)
%1641 = "stablehlo.multiply"(%1502, %1640) : (tensor<128x512x784xf32>, tensor<128x512x784xf32>) -> (tensor<128x512x784xf32>)
%1642 = "stablehlo.log"(%1641) : (tensor<128x512x784xf32>) -> (tensor<128x512x784xf32>)
%1643 = "stablehlo.add"(%1639, %1642) : (tensor<128x512x784xf32>, tensor<128x512x784xf32>) -> (tensor<128x512x784xf32>)
%1644 = "stablehlo.multiply"(%1500, %1500) : (tensor<128x512x784xf32>, tensor<128x512x784xf32>) -> (tensor<128x512x784xf32>)
%1645 = "stablehlo.subtract"(%1643, %1644) : (tensor<128x512x784xf32>, tensor<128x512x784xf32>) -> (tensor<128x512x784xf32>)
%1646 = "stablehlo.subtract"(%1645, %1641) : (tensor<128x512x784xf32>, tensor<128x512x784xf32>) -> (tensor<128x512x784xf32>)
%1647 = "stablehlo.multiply"(%1638, %1646) : (tensor<128x512x784xf32>, tensor<128x512x784xf32>) -> (tensor<128x512x784xf32>)
%1648 = "stablehlo.reduce"(%1647, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0,1>
} : (tensor<128x512x784xf32>, tensor<f32>) -> (tensor<784xf32>)
%1649 = "stablehlo.constant"() {
value = dense<6.553600e+04> : tensor<784xf32>
} : () -> (tensor<784xf32>)
%1650 = "stablehlo.divide"(%1648, %1649) : (tensor<784xf32>, tensor<784xf32>) -> (tensor<784xf32>)
%1651 = "stablehlo.reduce"(%1650, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0>
} : (tensor<784xf32>, tensor<f32>) -> (tensor<f32>)
%1652 = "stablehlo.constant"() {
value = dense<-5.000000e-01> : tensor<128x1x784xf32>
} : () -> (tensor<128x1x784xf32>)
%1653 = "stablehlo.constant"() {
value = dense<1.000000e+03> : tensor<128x1x784xf32>
} : () -> (tensor<128x1x784xf32>)
%1654 = "stablehlo.multiply"(%1507, %1653) : (tensor<128x1x784xf32>, tensor<128x1x784xf32>) -> (tensor<128x1x784xf32>)
%1655 = "stablehlo.log"(%1654) : (tensor<128x1x784xf32>) -> (tensor<128x1x784xf32>)
%1656 = "stablehlo.add"(%1447, %1655) : (tensor<128x1x784xf32>, tensor<128x1x784xf32>) -> (tensor<128x1x784xf32>)
%1657 = "stablehlo.multiply"(%1505, %1505) : (tensor<128x1x784xf32>, tensor<128x1x784xf32>) -> (tensor<128x1x784xf32>)
%1658 = "stablehlo.subtract"(%1656, %1657) : (tensor<128x1x784xf32>, tensor<128x1x784xf32>) -> (tensor<128x1x784xf32>)
%1659 = "stablehlo.subtract"(%1658, %1654) : (tensor<128x1x784xf32>, tensor<128x1x784xf32>) -> (tensor<128x1x784xf32>)
%1660 = "stablehlo.multiply"(%1652, %1659) : (tensor<128x1x784xf32>, tensor<128x1x784xf32>) -> (tensor<128x1x784xf32>)
%1661 = "stablehlo.reduce"(%1660, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0,1>
} : (tensor<128x1x784xf32>, tensor<f32>) -> (tensor<784xf32>)
%1662 = "stablehlo.constant"() {
value = dense<1.280000e+02> : tensor<784xf32>
} : () -> (tensor<784xf32>)
%1663 = "stablehlo.divide"(%1661, %1662) : (tensor<784xf32>, tensor<784xf32>) -> (tensor<784xf32>)
%1664 = "stablehlo.reduce"(%1663, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0>
} : (tensor<784xf32>, tensor<f32>) -> (tensor<f32>)
%1665 = "stablehlo.add"(%1651, %1664) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
%1666 = "stablehlo.add"(%1637, %1665) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
%1667 = "stablehlo.add"(%1612, %1666) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
%1668 = "stablehlo.constant"() {
value = dense<0.000000e+00> : tensor<784x512xf32>
} : () -> (tensor<784x512xf32>)
%1673 = "stablehlo.constant"() {
value = dense<1.000000e+00> : tensor<f32>
} : () -> (tensor<f32>)
%1674 = "stablehlo.broadcast_in_dim"(%1673) {
broadcast_dimensions = array<i64>
} : (tensor<f32>) -> (tensor<1x784xf32>)
%1675 = "stablehlo.transpose"(%1674) {
permutation = array<i64: 0,1>
} : (tensor<1x784xf32>) -> (tensor<1x784xf32>)
%1676 = "stablehlo.divide"(%1675, %1519) : (tensor<1x784xf32>, tensor<1x784xf32>) -> (tensor<1x784xf32>)
%1677 = "stablehlo.broadcast_in_dim"(%1676) {
broadcast_dimensions = array<i64: 1,2>
} : (tensor<1x784xf32>) -> (tensor<128x1x784xf32>)
%1678 = "stablehlo.transpose"(%1677) {
permutation = array<i64: 0,1,2>
} : (tensor<128x1x784xf32>) -> (tensor<128x1x784xf32>)
%1679 = "stablehlo.multiply"(%1515, %1678) : (tensor<128x1x784xf32>, tensor<128x1x784xf32>) -> (tensor<128x1x784xf32>)
%1680 = "stablehlo.subtract"(%1506, %1447) : (tensor<128x1x784xf32>, tensor<128x1x784xf32>) -> (tensor<128x1x784xf32>)
%1681 = "stablehlo.multiply"(%1679, %1680) : (tensor<128x1x784xf32>, tensor<128x1x784xf32>) -> (tensor<128x1x784xf32>)
%1682 = "stablehlo.multiply"(%1513, %1513) : (tensor<128x1x784xf32>, tensor<128x1x784xf32>) -> (tensor<128x1x784xf32>)
%1683 = "stablehlo.divide"(%1681, %1682) : (tensor<128x1x784xf32>, tensor<128x1x784xf32>) -> (tensor<128x1x784xf32>)
%1684 = "stablehlo.multiply"(%1683, %1512) : (tensor<128x1x784xf32>, tensor<128x1x784xf32>) -> (tensor<128x1x784xf32>)
%1685 = "stablehlo.multiply"(%1448, %1684) : (tensor<128x1x784xf32>, tensor<128x1x784xf32>) -> (tensor<128x1x784xf32>)
%1672 = "stablehlo.dot_general"(%1504, %1685) {
dot_dimension_numbers = #stablehlo.dot<
lhs_batching_dimensions = [0],
rhs_batching_dimensions = [0],
lhs_contracting_dimensions = [2],
rhs_contracting_dimensions = [2]
>
} : (tensor<128x512x784xf32>, tensor<128x1x784xf32>) -> (tensor<128x512x1xf32>)
%1686 = "stablehlo.transpose"(%1672) {
permutation = array<i64: 0,2,1>
} : (tensor<128x512x1xf32>) -> (tensor<128x1x512xf32>)
%1687 = "stablehlo.multiply"(%1499, %1499) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1688 = "stablehlo.subtract"(%1549, %1687) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1689 = "stablehlo.multiply"(%1686, %1688) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1671 = "stablehlo.dot_general"(%1493, %1689) {
dot_dimension_numbers = #stablehlo.dot<
lhs_batching_dimensions = [0],
rhs_batching_dimensions = [0],
lhs_contracting_dimensions = [2],
rhs_contracting_dimensions = [2]
>
} : (tensor<128x16x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x16x1xf32>)
%1690 = "stablehlo.transpose"(%1671) {
permutation = array<i64: 0,2,1>
} : (tensor<128x16x1xf32>) -> (tensor<128x1x16xf32>)
%1670 = "stablehlo.dot_general"(%1469, %1690) {
dot_dimension_numbers = #stablehlo.dot<
lhs_batching_dimensions = [0],
rhs_batching_dimensions = [0],
lhs_contracting_dimensions = [2],
rhs_contracting_dimensions = [2]
>
} : (tensor<128x512x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x512x1xf32>)
%1691 = "stablehlo.transpose"(%1670) {
permutation = array<i64: 0,2,1>
} : (tensor<128x512x1xf32>) -> (tensor<128x1x512xf32>)
%1692 = "stablehlo.multiply"(%1464, %1464) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1693 = "stablehlo.subtract"(%1549, %1692) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1694 = "stablehlo.multiply"(%1691, %1693) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1669 = "stablehlo.dot_general"(%531, %1694) {
dot_dimension_numbers = #stablehlo.dot<
lhs_batching_dimensions = [0],
rhs_batching_dimensions = [0],
lhs_contracting_dimensions = [1],
rhs_contracting_dimensions = [1]
>
} : (tensor<128x1x784xf32>, tensor<128x1x512xf32>) -> (tensor<128x784x512xf32>)
%1695 = "stablehlo.transpose"(%1669) {
permutation = array<i64: 0,1,2>
} : (tensor<128x784x512xf32>) -> (tensor<128x784x512xf32>)
%1696 = "stablehlo.reduce"(%1695, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0>
} : (tensor<128x784x512xf32>, tensor<f32>) -> (tensor<784x512xf32>)
%1699 = "stablehlo.multiply"(%1471, %1690) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1700 = "stablehlo.multiply"(%1699, %1486) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1698 = "stablehlo.dot_general"(%1480, %1700) {
dot_dimension_numbers = #stablehlo.dot<
lhs_batching_dimensions = [0],
rhs_batching_dimensions = [0],
lhs_contracting_dimensions = [2],
rhs_contracting_dimensions = [2]
>
} : (tensor<128x512x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x512x1xf32>)
%1701 = "stablehlo.transpose"(%1698) {
permutation = array<i64: 0,2,1>
} : (tensor<128x512x1xf32>) -> (tensor<128x1x512xf32>)
%1702 = "stablehlo.multiply"(%1701, %1693) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1697 = "stablehlo.dot_general"(%531, %1702) {
dot_dimension_numbers = #stablehlo.dot<
lhs_batching_dimensions = [0],
rhs_batching_dimensions = [0],
lhs_contracting_dimensions = [1],
rhs_contracting_dimensions = [1]
>
} : (tensor<128x1x784xf32>, tensor<128x1x512xf32>) -> (tensor<128x784x512xf32>)
%1703 = "stablehlo.transpose"(%1697) {
permutation = array<i64: 0,1,2>
} : (tensor<128x784x512xf32>) -> (tensor<128x784x512xf32>)
%1704 = "stablehlo.reduce"(%1703, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0>
} : (tensor<128x784x512xf32>, tensor<f32>) -> (tensor<784x512xf32>)
%1705 = "stablehlo.add"(%1696, %1704) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1706 = "stablehlo.subtract"(%1668, %1705) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1707 = "stablehlo.add"(%1706, %1706) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1710 = "stablehlo.broadcast_in_dim"(%1673) {
broadcast_dimensions = array<i64>
} : (tensor<f32>) -> (tensor<16xf32>)
%1711 = "stablehlo.transpose"(%1710) {
permutation = array<i64: 0>
} : (tensor<16xf32>) -> (tensor<16xf32>)
%1712 = "stablehlo.divide"(%1711, %1530) : (tensor<16xf32>, tensor<16xf32>) -> (tensor<16xf32>)
%1713 = "stablehlo.broadcast_in_dim"(%1712) {
broadcast_dimensions = array<i64: 2>
} : (tensor<16xf32>) -> (tensor<128x1x16xf32>)
%1714 = "stablehlo.transpose"(%1713) {
permutation = array<i64: 0,1,2>
} : (tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1715 = "stablehlo.multiply"(%1522, %1714) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1709 = "stablehlo.dot_general"(%1480, %1715) {
dot_dimension_numbers = #stablehlo.dot<
lhs_batching_dimensions = [0],
rhs_batching_dimensions = [0],
lhs_contracting_dimensions = [2],
rhs_contracting_dimensions = [2]
>
} : (tensor<128x512x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x512x1xf32>)
%1716 = "stablehlo.transpose"(%1709) {
permutation = array<i64: 0,2,1>
} : (tensor<128x512x1xf32>) -> (tensor<128x1x512xf32>)
%1717 = "stablehlo.multiply"(%1716, %1693) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1708 = "stablehlo.dot_general"(%531, %1717) {
dot_dimension_numbers = #stablehlo.dot<
lhs_batching_dimensions = [0],
rhs_batching_dimensions = [0],
lhs_contracting_dimensions = [1],
rhs_contracting_dimensions = [1]
>
} : (tensor<128x1x784xf32>, tensor<128x1x512xf32>) -> (tensor<128x784x512xf32>)
%1718 = "stablehlo.transpose"(%1708) {
permutation = array<i64: 0,1,2>
} : (tensor<128x784x512xf32>) -> (tensor<128x784x512xf32>)
%1719 = "stablehlo.reduce"(%1718, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0>
} : (tensor<128x784x512xf32>, tensor<f32>) -> (tensor<784x512xf32>)
%1722 = "stablehlo.multiply"(%1475, %1715) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1721 = "stablehlo.dot_general"(%1469, %1722) {
dot_dimension_numbers = #stablehlo.dot<
lhs_batching_dimensions = [0],
rhs_batching_dimensions = [0],
lhs_contracting_dimensions = [2],
rhs_contracting_dimensions = [2]
>
} : (tensor<128x512x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x512x1xf32>)
%1723 = "stablehlo.transpose"(%1721) {
permutation = array<i64: 0,2,1>
} : (tensor<128x512x1xf32>) -> (tensor<128x1x512xf32>)
%1724 = "stablehlo.multiply"(%1723, %1693) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1720 = "stablehlo.dot_general"(%531, %1724) {
dot_dimension_numbers = #stablehlo.dot<
lhs_batching_dimensions = [0],
rhs_batching_dimensions = [0],
lhs_contracting_dimensions = [1],
rhs_contracting_dimensions = [1]
>
} : (tensor<128x1x784xf32>, tensor<128x1x512xf32>) -> (tensor<128x784x512xf32>)
%1725 = "stablehlo.transpose"(%1720) {
permutation = array<i64: 0,1,2>
} : (tensor<128x784x512xf32>) -> (tensor<128x784x512xf32>)
%1726 = "stablehlo.reduce"(%1725, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0>
} : (tensor<128x784x512xf32>, tensor<f32>) -> (tensor<784x512xf32>)
%1727 = "stablehlo.add"(%1726, %1726) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1728 = "stablehlo.subtract"(%1719, %1727) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1731 = "stablehlo.multiply"(%1715, %1486) : (tensor<128x1x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x1x16xf32>)
%1730 = "stablehlo.dot_general"(%1480, %1731) {
dot_dimension_numbers = #stablehlo.dot<
lhs_batching_dimensions = [0],
rhs_batching_dimensions = [0],
lhs_contracting_dimensions = [2],
rhs_contracting_dimensions = [2]
>
} : (tensor<128x512x16xf32>, tensor<128x1x16xf32>) -> (tensor<128x512x1xf32>)
%1732 = "stablehlo.transpose"(%1730) {
permutation = array<i64: 0,2,1>
} : (tensor<128x512x1xf32>) -> (tensor<128x1x512xf32>)
%1733 = "stablehlo.multiply"(%1732, %1693) : (tensor<128x1x512xf32>, tensor<128x1x512xf32>) -> (tensor<128x1x512xf32>)
%1729 = "stablehlo.dot_general"(%531, %1733) {
dot_dimension_numbers = #stablehlo.dot<
lhs_batching_dimensions = [0],
rhs_batching_dimensions = [0],
lhs_contracting_dimensions = [1],
rhs_contracting_dimensions = [1]
>
} : (tensor<128x1x784xf32>, tensor<128x1x512xf32>) -> (tensor<128x784x512xf32>)
%1734 = "stablehlo.transpose"(%1729) {
permutation = array<i64: 0,1,2>
} : (tensor<128x784x512xf32>) -> (tensor<128x784x512xf32>)
%1735 = "stablehlo.reduce"(%1734, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0>
} : (tensor<128x784x512xf32>, tensor<f32>) -> (tensor<784x512xf32>)
%1736 = "stablehlo.subtract"(%1728, %1735) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1737 = "stablehlo.add"(%1707, %1736) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1738 = "stablehlo.broadcast_in_dim"(%1673) {
broadcast_dimensions = array<i64>
} : (tensor<f32>) -> (tensor<512xf32>)
%1739 = "stablehlo.transpose"(%1738) {
permutation = array<i64: 0>
} : (tensor<512xf32>) -> (tensor<512xf32>)
%1740 = "stablehlo.divide"(%1739, %1545) : (tensor<512xf32>, tensor<512xf32>) -> (tensor<512xf32>)
%1741 = "stablehlo.broadcast_in_dim"(%1740) {
broadcast_dimensions = array<i64: 2>
} : (tensor<512xf32>) -> (tensor<128x784x512xf32>)
%1742 = "stablehlo.transpose"(%1741) {
permutation = array<i64: 0,1,2>
} : (tensor<128x784x512xf32>) -> (tensor<128x784x512xf32>)
%1743 = "stablehlo.multiply"(%1534, %1742) : (tensor<128x784x512xf32>, tensor<128x784x512xf32>) -> (tensor<128x784x512xf32>)
%1744 = "stablehlo.multiply"(%1453, %1743) : (tensor<128x784x512xf32>, tensor<128x784x512xf32>) -> (tensor<128x784x512xf32>)
%1745 = "stablehlo.reduce"(%1744, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
"stablehlo.return"(%z) : (tensor<f32>) -> ()
}) {
dimensions = array<i64: 0>
} : (tensor<128x784x512xf32>, tensor<f32>) -> (tensor<784x512xf32>)
%1746 = "stablehlo.add"(%1745, %1745) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1747 = "stablehlo.subtract"(%1668, %1746) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1748 = "stablehlo.add"(%1737, %1747) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1749 = "stablehlo.constant"() {
value = dense<1.000000e-06> : tensor<784x512xf32>
} : () -> (tensor<784x512xf32>)
%1750 = "stablehlo.multiply"(%1748, %1749) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1751 = "stablehlo.subtract"(%592, %1750) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1752 = "stablehlo.constant"() {
value = dense<1.000000e-04> : tensor<784x512xf32>
} : () -> (tensor<784x512xf32>)
%1753 = "stablehlo.constant"() {
value = dense<9.000000e-01> : tensor<784x512xf32>
} : () -> (tensor<784x512xf32>)
%1754 = "stablehlo.multiply"(%1753, %571) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1755 = "stablehlo.constant"() {
value = dense<1.000000e-01> : tensor<784x512xf32>
} : () -> (tensor<784x512xf32>)
%1756 = "stablehlo.multiply"(%1755, %1748) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1757 = "stablehlo.add"(%1754, %1756) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1758 = "stablehlo.constant"() {
value = dense<9.000000e-01> : tensor<f32>
} : () -> (tensor<f32>)
%1759 = "stablehlo.power"(%1758, %572) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
%1760 = "stablehlo.subtract"(%1673, %1759) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
%1761 = "stablehlo.broadcast_in_dim"(%1760) {
broadcast_dimensions = array<i64>
} : (tensor<f32>) -> (tensor<784x512xf32>)
%1762 = "stablehlo.divide"(%1757, %1761) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1763 = "stablehlo.multiply"(%1752, %1762) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1764 = "stablehlo.constant"() {
value = dense<9.990000e-01> : tensor<784x512xf32>
} : () -> (tensor<784x512xf32>)
%1765 = "stablehlo.multiply"(%1764, %551) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1766 = "stablehlo.constant"() {
value = dense<1.000000e-03> : tensor<784x512xf32>
} : () -> (tensor<784x512xf32>)
%1767 = "stablehlo.multiply"(%1748, %1748) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1768 = "stablehlo.multiply"(%1766, %1767) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1769 = "stablehlo.add"(%1765, %1768) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1770 = "stablehlo.constant"() {
value = dense<9.990000e-01> : tensor<f32>
} : () -> (tensor<f32>)
%1771 = "stablehlo.power"(%1770, %572) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
%1772 = "stablehlo.subtract"(%1673, %1771) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
%1773 = "stablehlo.broadcast_in_dim"(%1772) {
broadcast_dimensions = array<i64>
} : (tensor<f32>) -> (tensor<784x512xf32>)
%1774 = "stablehlo.divide"(%1769, %1773) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1775 = "stablehlo.constant"() {
value = dense<5.000000e-01> : tensor<784x512xf32>
} : () -> (tensor<784x512xf32>)
%1776 = "stablehlo.power"(%1774, %1775) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1777 = "stablehlo.constant"() {
value = dense<1.000000e-08> : tensor<784x512xf32>
} : () -> (tensor<784x512xf32>)
%1778 = "stablehlo.add"(%1776, %1777) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1779 = "stablehlo.divide"(%1763, %1778) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1780 = "stablehlo.subtract"(%1751, %1779) : (tensor<784x512xf32>, tensor<784x512xf32>) -> (tensor<784x512xf32>)
%1781 = "stablehlo.multiply"(%1454, %1695) : (tensor<128x784x512xf32>, tensor<128x784x512xf32>) -> (tensor<128x784x512xf32>)
%1782 = "stablehlo.reduce"(%1781, %1517)({^a(%x : tensor<f32>, %y : tensor<f32>):
%z = "stablehlo.add"(%x, %y) : (tensor<f32>, tensor<f32>) -> (tensor<f32>)
