module @jit_optim attributes {jax.uses_shape_polymorphism = false, mhlo.num_partitions = 1 : i32, mhlo.num_replicas = 1 : i32} {
  func.func public @main(%arg0: tensor<2xui32>, %arg1: tensor<784x512xf32>, %arg2: tensor<784x512xf32>, %arg3: tensor<512xf32>, %arg4: tensor<512xf32>, %arg5: tensor<512x16xf32>, %arg6: tensor<512x16xf32>, %arg7: tensor<16xf32>, %arg8: tensor<16xf32>, %arg9: tensor<512x16xf32>, %arg10: tensor<512x16xf32>, %arg11: tensor<16xf32>, %arg12: tensor<16xf32>, %arg13: tensor<16x512xf32>, %arg14: tensor<16x512xf32>, %arg15: tensor<512xf32>, %arg16: tensor<512xf32>, %arg17: tensor<512x784xf32>, %arg18: tensor<512x784xf32>, %arg19: tensor<784xf32>, %arg20: tensor<784xf32>, %arg21: tensor<i32>, %arg22: tensor<784x512xf32>, %arg23: tensor<784x512xf32>, %arg24: tensor<512xf32>, %arg25: tensor<512xf32>, %arg26: tensor<512x16xf32>, %arg27: tensor<512x16xf32>, %arg28: tensor<16xf32>, %arg29: tensor<16xf32>, %arg30: tensor<512x16xf32>, %arg31: tensor<512x16xf32>, %arg32: tensor<16xf32>, %arg33: tensor<16xf32>, %arg34: tensor<16x512xf32>, %arg35: tensor<16x512xf32>, %arg36: tensor<512xf32>, %arg37: tensor<512xf32>, %arg38: tensor<512x784xf32>, %arg39: tensor<512x784xf32>, %arg40: tensor<784xf32>, %arg41: tensor<784xf32>, %arg42: tensor<784x512xf32>, %arg43: tensor<784x512xf32>, %arg44: tensor<512xf32>, %arg45: tensor<512xf32>, %arg46: tensor<512x16xf32>, %arg47: tensor<512x16xf32>, %arg48: tensor<16xf32>, %arg49: tensor<16xf32>, %arg50: tensor<512x16xf32>, %arg51: tensor<512x16xf32>, %arg52: tensor<16xf32>, %arg53: tensor<16xf32>, %arg54: tensor<16x512xf32>, %arg55: tensor<16x512xf32>, %arg56: tensor<512xf32>, %arg57: tensor<512xf32>, %arg58: tensor<512x784xf32>, %arg59: tensor<512x784xf32>, %arg60: tensor<784xf32>, %arg61: tensor<784xf32>, %arg62: tensor<32x784xf32>) -> (tensor<784x512xf32> {jax.result_info = "[0][0][0]"}, tensor<784x512xf32> {jax.result_info = "[0][0][1]"}, tensor<512xf32> {jax.result_info = "[0][1][0]"}, tensor<512xf32> {jax.result_info = "[0][1][1]"}, tensor<512x16xf32> {jax.result_info = "[0][2][0]"}, tensor<512x16xf32> {jax.result_info = "[0][2][1]"}, tensor<16xf32> {jax.result_info = "[0][3][0]"}, tensor<16xf32> {jax.result_info = "[0][3][1]"}, tensor<512x16xf32> {jax.result_info = "[0][4][0]"}, tensor<512x16xf32> {jax.result_info = "[0][4][1]"}, tensor<16xf32> {jax.result_info = "[0][5][0]"}, tensor<16xf32> {jax.result_info = "[0][5][1]"}, tensor<16x512xf32> {jax.result_info = "[0][6][0]"}, tensor<16x512xf32> {jax.result_info = "[0][6][1]"}, tensor<512xf32> {jax.result_info = "[0][7][0]"}, tensor<512xf32> {jax.result_info = "[0][7][1]"}, tensor<512x784xf32> {jax.result_info = "[0][8][0]"}, tensor<512x784xf32> {jax.result_info = "[0][8][1]"}, tensor<784xf32> {jax.result_info = "[0][9][0]"}, tensor<784xf32> {jax.result_info = "[0][9][1]"}, tensor<i32> {jax.result_info = "[0][10][0].count"}, tensor<784x512xf32> {jax.result_info = "[0][10][0].mu[0][0]"}, tensor<784x512xf32> {jax.result_info = "[0][10][0].mu[0][1]"}, tensor<512xf32> {jax.result_info = "[0][10][0].mu[1][0]"}, tensor<512xf32> {jax.result_info = "[0][10][0].mu[1][1]"}, tensor<512x16xf32> {jax.result_info = "[0][10][0].mu[2][0]"}, tensor<512x16xf32> {jax.result_info = "[0][10][0].mu[2][1]"}, tensor<16xf32> {jax.result_info = "[0][10][0].mu[3][0]"}, tensor<16xf32> {jax.result_info = "[0][10][0].mu[3][1]"}, tensor<512x16xf32> {jax.result_info = "[0][10][0].mu[4][0]"}, tensor<512x16xf32> {jax.result_info = "[0][10][0].mu[4][1]"}, tensor<16xf32> {jax.result_info = "[0][10][0].mu[5][0]"}, tensor<16xf32> {jax.result_info = "[0][10][0].mu[5][1]"}, tensor<16x512xf32> {jax.result_info = "[0][10][0].mu[6][0]"}, tensor<16x512xf32> {jax.result_info = "[0][10][0].mu[6][1]"}, tensor<512xf32> {jax.result_info = "[0][10][0].mu[7][0]"}, tensor<512xf32> {jax.result_info = "[0][10][0].mu[7][1]"}, tensor<512x784xf32> {jax.result_info = "[0][10][0].mu[8][0]"}, tensor<512x784xf32> {jax.result_info = "[0][10][0].mu[8][1]"}, tensor<784xf32> {jax.result_info = "[0][10][0].mu[9][0]"}, tensor<784xf32> {jax.result_info = "[0][10][0].mu[9][1]"}, tensor<784x512xf32> {jax.result_info = "[0][10][0].nu[0][0]"}, tensor<784x512xf32> {jax.result_info = "[0][10][0].nu[0][1]"}, tensor<512xf32> {jax.result_info = "[0][10][0].nu[1][0]"}, tensor<512xf32> {jax.result_info = "[0][10][0].nu[1][1]"}, tensor<512x16xf32> {jax.result_info = "[0][10][0].nu[2][0]"}, tensor<512x16xf32> {jax.result_info = "[0][10][0].nu[2][1]"}, tensor<16xf32> {jax.result_info = "[0][10][0].nu[3][0]"}, tensor<16xf32> {jax.result_info = "[0][10][0].nu[3][1]"}, tensor<512x16xf32> {jax.result_info = "[0][10][0].nu[4][0]"}, tensor<512x16xf32> {jax.result_info = "[0][10][0].nu[4][1]"}, tensor<16xf32> {jax.result_info = "[0][10][0].nu[5][0]"}, tensor<16xf32> {jax.result_info = "[0][10][0].nu[5][1]"}, tensor<16x512xf32> {jax.result_info = "[0][10][0].nu[6][0]"}, tensor<16x512xf32> {jax.result_info = "[0][10][0].nu[6][1]"}, tensor<512xf32> {jax.result_info = "[0][10][0].nu[7][0]"}, tensor<512xf32> {jax.result_info = "[0][10][0].nu[7][1]"}, tensor<512x784xf32> {jax.result_info = "[0][10][0].nu[8][0]"}, tensor<512x784xf32> {jax.result_info = "[0][10][0].nu[8][1]"}, tensor<784xf32> {jax.result_info = "[0][10][0].nu[9][0]"}, tensor<784xf32> {jax.result_info = "[0][10][0].nu[9][1]"}, tensor<f32> {jax.result_info = "[1]"}) {
    %cst = stablehlo.constant dense<-9.99999974E-5> : tensor<f32>
    %cst_0 = stablehlo.constant dense<9.99999974E-5> : tensor<f32>
    %cst_1 = stablehlo.constant dense<9.99999993E-9> : tensor<f32>
    %c = stablehlo.constant dense<1> : tensor<i32>
    %c_2 = stablehlo.constant dense<2147483647> : tensor<i32>
    %cst_3 = stablehlo.constant dense<9.990000e-01> : tensor<f32>
    %cst_4 = stablehlo.constant dense<1.000000e-03> : tensor<f32>
    %cst_5 = stablehlo.constant dense<0.899999976> : tensor<f32>
    %cst_6 = stablehlo.constant dense<1.000000e-01> : tensor<f32>
    %cst_7 = stablehlo.constant dense<1.600000e+01> : tensor<f32>
    %cst_8 = stablehlo.constant dense<5.120000e+02> : tensor<f32>
    %cst_9 = stablehlo.constant dense<7.840000e+02> : tensor<f32>
    %cst_10 = stablehlo.constant dense<1.000000e+03> : tensor<f32>
    %cst_11 = stablehlo.constant dense<-5.000000e-01> : tensor<f32>
    %cst_12 = stablehlo.constant dense<3.200000e+01> : tensor<f32>
    %cst_13 = stablehlo.constant dense<0.000000e+00> : tensor<f32>
    %cst_14 = stablehlo.constant dense<2.000000e+00> : tensor<f32>
    %cst_15 = stablehlo.constant dense<1.000000e+00> : tensor<f32>
    %1 = call @_threefry_split(%arg0) : (tensor<2xui32>) -> tensor<2x2xui32>
    %2 = stablehlo.slice %1 [0:1, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %3 = stablehlo.reshape %2 : (tensor<1x2xui32>) -> tensor<2xui32>
    %4 = stablehlo.slice %1 [1:2, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %5 = stablehlo.reshape %4 : (tensor<1x2xui32>) -> tensor<2xui32>
    %6 = call @_normal(%3) : (tensor<2xui32>) -> tensor<32x784x512xf32>
    %7 = stablehlo.broadcast_in_dim %arg2, dims = [1, 2] : (tensor<784x512xf32>) -> tensor<1x784x512xf32>
    %8 = stablehlo.broadcast_in_dim %7, dims = [0, 1, 2] : (tensor<1x784x512xf32>) -> tensor<32x784x512xf32>
    %9 = stablehlo.multiply %8, %6 : tensor<32x784x512xf32>
    %10 = stablehlo.broadcast_in_dim %arg1, dims = [1, 2] : (tensor<784x512xf32>) -> tensor<1x784x512xf32>
    %11 = stablehlo.broadcast_in_dim %10, dims = [0, 1, 2] : (tensor<1x784x512xf32>) -> tensor<32x784x512xf32>
    %12 = stablehlo.add %11, %9 : tensor<32x784x512xf32>
    %13 = call @_threefry_split(%5) : (tensor<2xui32>) -> tensor<2x2xui32>
    %14 = stablehlo.slice %13 [0:1, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %15 = stablehlo.reshape %14 : (tensor<1x2xui32>) -> tensor<2xui32>
    %16 = stablehlo.slice %13 [1:2, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %17 = stablehlo.reshape %16 : (tensor<1x2xui32>) -> tensor<2xui32>
    %18 = call @_normal_1(%15) : (tensor<2xui32>) -> tensor<32x512xf32>
    %19 = stablehlo.broadcast_in_dim %arg4, dims = [1] : (tensor<512xf32>) -> tensor<1x512xf32>
    %20 = stablehlo.broadcast_in_dim %19, dims = [0, 1] : (tensor<1x512xf32>) -> tensor<32x512xf32>
    %21 = stablehlo.multiply %20, %18 : tensor<32x512xf32>
    %22 = stablehlo.broadcast_in_dim %arg3, dims = [1] : (tensor<512xf32>) -> tensor<1x512xf32>
    %23 = stablehlo.broadcast_in_dim %22, dims = [0, 1] : (tensor<1x512xf32>) -> tensor<32x512xf32>
    %24 = stablehlo.add %23, %21 : tensor<32x512xf32>
    %25 = stablehlo.broadcast_in_dim %arg62, dims = [0, 2] : (tensor<32x784xf32>) -> tensor<32x1x784xf32>
    %26 = stablehlo.dot_general %25, %12, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<32x1x784xf32>, tensor<32x784x512xf32>) -> tensor<32x1x512xf32>
    %27 = stablehlo.broadcast_in_dim %24, dims = [0, 2] : (tensor<32x512xf32>) -> tensor<32x1x512xf32>
    %28 = stablehlo.add %26, %27 : tensor<32x1x512xf32>
    %29 = stablehlo.tanh %28 : tensor<32x1x512xf32>
    %30 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<32x1x512xf32>
    %31 = stablehlo.subtract %30, %29 : tensor<32x1x512xf32>
    %32 = call @_threefry_split(%17) : (tensor<2xui32>) -> tensor<2x2xui32>
    %33 = stablehlo.slice %32 [0:1, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %34 = stablehlo.reshape %33 : (tensor<1x2xui32>) -> tensor<2xui32>
    %35 = stablehlo.slice %32 [1:2, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %36 = stablehlo.reshape %35 : (tensor<1x2xui32>) -> tensor<2xui32>
    %37 = call @_normal_5(%34) : (tensor<2xui32>) -> tensor<32x512x16xf32>
    %38 = stablehlo.broadcast_in_dim %arg6, dims = [1, 2] : (tensor<512x16xf32>) -> tensor<1x512x16xf32>
    %39 = stablehlo.broadcast_in_dim %38, dims = [0, 1, 2] : (tensor<1x512x16xf32>) -> tensor<32x512x16xf32>
    %40 = stablehlo.multiply %39, %37 : tensor<32x512x16xf32>
    %41 = stablehlo.broadcast_in_dim %arg5, dims = [1, 2] : (tensor<512x16xf32>) -> tensor<1x512x16xf32>
    %42 = stablehlo.broadcast_in_dim %41, dims = [0, 1, 2] : (tensor<1x512x16xf32>) -> tensor<32x512x16xf32>
    %43 = stablehlo.add %42, %40 : tensor<32x512x16xf32>
    %44 = call @_threefry_split(%36) : (tensor<2xui32>) -> tensor<2x2xui32>
    %45 = stablehlo.slice %44 [0:1, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %46 = stablehlo.reshape %45 : (tensor<1x2xui32>) -> tensor<2xui32>
    %47 = stablehlo.slice %44 [1:2, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %48 = stablehlo.reshape %47 : (tensor<1x2xui32>) -> tensor<2xui32>
    %49 = call @_normal_9(%46) : (tensor<2xui32>) -> tensor<32x16xf32>
    %50 = stablehlo.broadcast_in_dim %arg8, dims = [1] : (tensor<16xf32>) -> tensor<1x16xf32>
    %51 = stablehlo.broadcast_in_dim %50, dims = [0, 1] : (tensor<1x16xf32>) -> tensor<32x16xf32>
    %52 = stablehlo.multiply %51, %49 : tensor<32x16xf32>
    %53 = stablehlo.broadcast_in_dim %arg7, dims = [1] : (tensor<16xf32>) -> tensor<1x16xf32>
    %54 = stablehlo.broadcast_in_dim %53, dims = [0, 1] : (tensor<1x16xf32>) -> tensor<32x16xf32>
    %55 = stablehlo.add %54, %52 : tensor<32x16xf32>
    %56 = stablehlo.dot_general %29, %43, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<32x1x512xf32>, tensor<32x512x16xf32>) -> tensor<32x1x16xf32>
    %57 = stablehlo.broadcast_in_dim %55, dims = [0, 2] : (tensor<32x16xf32>) -> tensor<32x1x16xf32>
    %58 = stablehlo.add %56, %57 : tensor<32x1x16xf32>
    %59 = call @_threefry_split(%48) : (tensor<2xui32>) -> tensor<2x2xui32>
    %60 = stablehlo.slice %59 [0:1, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %61 = stablehlo.reshape %60 : (tensor<1x2xui32>) -> tensor<2xui32>
    %62 = stablehlo.slice %59 [1:2, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %63 = stablehlo.reshape %62 : (tensor<1x2xui32>) -> tensor<2xui32>
    %64 = call @_normal_5(%61) : (tensor<2xui32>) -> tensor<32x512x16xf32>
    %65 = stablehlo.broadcast_in_dim %arg10, dims = [1, 2] : (tensor<512x16xf32>) -> tensor<1x512x16xf32>
    %66 = stablehlo.broadcast_in_dim %65, dims = [0, 1, 2] : (tensor<1x512x16xf32>) -> tensor<32x512x16xf32>
    %67 = stablehlo.multiply %66, %64 : tensor<32x512x16xf32>
    %68 = stablehlo.broadcast_in_dim %arg9, dims = [1, 2] : (tensor<512x16xf32>) -> tensor<1x512x16xf32>
    %69 = stablehlo.broadcast_in_dim %68, dims = [0, 1, 2] : (tensor<1x512x16xf32>) -> tensor<32x512x16xf32>
    %70 = stablehlo.add %69, %67 : tensor<32x512x16xf32>
    %71 = call @_threefry_split(%63) : (tensor<2xui32>) -> tensor<2x2xui32>
    %72 = stablehlo.slice %71 [0:1, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %73 = stablehlo.reshape %72 : (tensor<1x2xui32>) -> tensor<2xui32>
    %74 = stablehlo.slice %71 [1:2, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %75 = stablehlo.reshape %74 : (tensor<1x2xui32>) -> tensor<2xui32>
    %76 = call @_normal_9(%73) : (tensor<2xui32>) -> tensor<32x16xf32>
    %77 = stablehlo.broadcast_in_dim %arg12, dims = [1] : (tensor<16xf32>) -> tensor<1x16xf32>
    %78 = stablehlo.broadcast_in_dim %77, dims = [0, 1] : (tensor<1x16xf32>) -> tensor<32x16xf32>
    %79 = stablehlo.multiply %78, %76 : tensor<32x16xf32>
    %80 = stablehlo.broadcast_in_dim %arg11, dims = [1] : (tensor<16xf32>) -> tensor<1x16xf32>
    %81 = stablehlo.broadcast_in_dim %80, dims = [0, 1] : (tensor<1x16xf32>) -> tensor<32x16xf32>
    %82 = stablehlo.add %81, %79 : tensor<32x16xf32>
    %83 = stablehlo.dot_general %29, %70, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<32x1x512xf32>, tensor<32x512x16xf32>) -> tensor<32x1x16xf32>
    %84 = stablehlo.broadcast_in_dim %82, dims = [0, 2] : (tensor<32x16xf32>) -> tensor<32x1x16xf32>
    %85 = stablehlo.add %83, %84 : tensor<32x1x16xf32>
    %86 = stablehlo.exponential %85 : tensor<32x1x16xf32>
    %87 = call @_threefry_split(%75) : (tensor<2xui32>) -> tensor<2x2xui32>
    %88 = stablehlo.slice %87 [0:1, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %89 = stablehlo.reshape %88 : (tensor<1x2xui32>) -> tensor<2xui32>
    %90 = stablehlo.slice %87 [1:2, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %91 = stablehlo.reshape %90 : (tensor<1x2xui32>) -> tensor<2xui32>
    %92 = call @_normal_13(%89) : (tensor<2xui32>) -> tensor<32x1x16xf32>
    %93 = stablehlo.multiply %86, %92 : tensor<32x1x16xf32>
    %94 = stablehlo.add %58, %93 : tensor<32x1x16xf32>
    %95 = call @_threefry_split(%91) : (tensor<2xui32>) -> tensor<2x2xui32>
    %96 = stablehlo.slice %95 [0:1, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %97 = stablehlo.reshape %96 : (tensor<1x2xui32>) -> tensor<2xui32>
    %98 = stablehlo.slice %95 [1:2, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %99 = stablehlo.reshape %98 : (tensor<1x2xui32>) -> tensor<2xui32>
    %100 = call @_normal_16(%97) : (tensor<2xui32>) -> tensor<32x16x512xf32>
    %101 = stablehlo.broadcast_in_dim %arg14, dims = [1, 2] : (tensor<16x512xf32>) -> tensor<1x16x512xf32>
    %102 = stablehlo.broadcast_in_dim %101, dims = [0, 1, 2] : (tensor<1x16x512xf32>) -> tensor<32x16x512xf32>
    %103 = stablehlo.multiply %102, %100 : tensor<32x16x512xf32>
    %104 = stablehlo.broadcast_in_dim %arg13, dims = [1, 2] : (tensor<16x512xf32>) -> tensor<1x16x512xf32>
    %105 = stablehlo.broadcast_in_dim %104, dims = [0, 1, 2] : (tensor<1x16x512xf32>) -> tensor<32x16x512xf32>
    %106 = stablehlo.add %105, %103 : tensor<32x16x512xf32>
    %107 = call @_threefry_split(%99) : (tensor<2xui32>) -> tensor<2x2xui32>
    %108 = stablehlo.slice %107 [0:1, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %109 = stablehlo.reshape %108 : (tensor<1x2xui32>) -> tensor<2xui32>
    %110 = stablehlo.slice %107 [1:2, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %111 = stablehlo.reshape %110 : (tensor<1x2xui32>) -> tensor<2xui32>
    %112 = call @_normal_1(%109) : (tensor<2xui32>) -> tensor<32x512xf32>
    %113 = stablehlo.broadcast_in_dim %arg16, dims = [1] : (tensor<512xf32>) -> tensor<1x512xf32>
    %114 = stablehlo.broadcast_in_dim %113, dims = [0, 1] : (tensor<1x512xf32>) -> tensor<32x512xf32>
    %115 = stablehlo.multiply %114, %112 : tensor<32x512xf32>
    %116 = stablehlo.broadcast_in_dim %arg15, dims = [1] : (tensor<512xf32>) -> tensor<1x512xf32>
    %117 = stablehlo.broadcast_in_dim %116, dims = [0, 1] : (tensor<1x512xf32>) -> tensor<32x512xf32>
    %118 = stablehlo.add %117, %115 : tensor<32x512xf32>
    %119 = stablehlo.dot_general %94, %106, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<32x1x16xf32>, tensor<32x16x512xf32>) -> tensor<32x1x512xf32>
    %120 = stablehlo.broadcast_in_dim %118, dims = [0, 2] : (tensor<32x512xf32>) -> tensor<32x1x512xf32>
    %121 = stablehlo.add %119, %120 : tensor<32x1x512xf32>
    %122 = stablehlo.tanh %121 : tensor<32x1x512xf32>
    %123 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<32x1x512xf32>
    %124 = stablehlo.subtract %123, %122 : tensor<32x1x512xf32>
    %125 = call @_threefry_split(%111) : (tensor<2xui32>) -> tensor<2x2xui32>
    %126 = stablehlo.slice %125 [0:1, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %127 = stablehlo.reshape %126 : (tensor<1x2xui32>) -> tensor<2xui32>
    %128 = stablehlo.slice %125 [1:2, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %129 = stablehlo.reshape %128 : (tensor<1x2xui32>) -> tensor<2xui32>
    %130 = call @_normal_19(%127) : (tensor<2xui32>) -> tensor<32x512x784xf32>
    %131 = stablehlo.broadcast_in_dim %arg18, dims = [1, 2] : (tensor<512x784xf32>) -> tensor<1x512x784xf32>
    %132 = stablehlo.broadcast_in_dim %131, dims = [0, 1, 2] : (tensor<1x512x784xf32>) -> tensor<32x512x784xf32>
    %133 = stablehlo.multiply %132, %130 : tensor<32x512x784xf32>
    %134 = stablehlo.broadcast_in_dim %arg17, dims = [1, 2] : (tensor<512x784xf32>) -> tensor<1x512x784xf32>
    %135 = stablehlo.broadcast_in_dim %134, dims = [0, 1, 2] : (tensor<1x512x784xf32>) -> tensor<32x512x784xf32>
    %136 = stablehlo.add %135, %133 : tensor<32x512x784xf32>
    %137 = call @_threefry_split(%129) : (tensor<2xui32>) -> tensor<2x2xui32>
    %138 = stablehlo.slice %137 [0:1, 0:2] : (tensor<2x2xui32>) -> tensor<1x2xui32>
    %139 = stablehlo.reshape %138 : (tensor<1x2xui32>) -> tensor<2xui32>
    %140 = call @_normal_22(%139) : (tensor<2xui32>) -> tensor<32x784xf32>
    %141 = stablehlo.broadcast_in_dim %arg20, dims = [1] : (tensor<784xf32>) -> tensor<1x784xf32>
    %142 = stablehlo.broadcast_in_dim %141, dims = [0, 1] : (tensor<1x784xf32>) -> tensor<32x784xf32>
    %143 = stablehlo.multiply %142, %140 : tensor<32x784xf32>
    %144 = stablehlo.broadcast_in_dim %arg19, dims = [1] : (tensor<784xf32>) -> tensor<1x784xf32>
    %145 = stablehlo.broadcast_in_dim %144, dims = [0, 1] : (tensor<1x784xf32>) -> tensor<32x784xf32>
    %146 = stablehlo.add %145, %143 : tensor<32x784xf32>
    %147 = stablehlo.dot_general %122, %136, batching_dims = [0] x [0], contracting_dims = [2] x [1] : (tensor<32x1x512xf32>, tensor<32x512x784xf32>) -> tensor<32x1x784xf32>
    %148 = stablehlo.broadcast_in_dim %146, dims = [0, 2] : (tensor<32x784xf32>) -> tensor<32x1x784xf32>
    %149 = stablehlo.add %147, %148 : tensor<32x1x784xf32>
    %150 = stablehlo.negate %149 : tensor<32x1x784xf32>
    %151 = stablehlo.exponential %150 : tensor<32x1x784xf32>
    %152 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<32x1x784xf32>
    %153 = stablehlo.add %152, %151 : tensor<32x1x784xf32>
    %154 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<32x1x784xf32>
    %155 = stablehlo.divide %154, %153 : tensor<32x1x784xf32>
    %156 = stablehlo.multiply %153, %153 : tensor<32x1x784xf32>
    %157 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<32x1x784xf32>
    %158 = stablehlo.divide %157, %156 : tensor<32x1x784xf32>
    %159 = stablehlo.broadcast_in_dim %arg62, dims = [0, 2] : (tensor<32x784xf32>) -> tensor<32x1x784xf32>
    %160 = stablehlo.subtract %159, %155 : tensor<32x1x784xf32>
    %161 = stablehlo.multiply %160, %160 : tensor<32x1x784xf32>
    %162 = stablehlo.broadcast_in_dim %cst_14, dims = [] : (tensor<f32>) -> tensor<32x1x784xf32>
    %163 = stablehlo.multiply %162, %160 : tensor<32x1x784xf32>
    %164 = stablehlo.reduce(%161 init: %cst_13) applies stablehlo.add across dimensions = [2] : (tensor<32x1x784xf32>, tensor<f32>) -> tensor<32x1xf32>
    %165 = stablehlo.reduce(%164 init: %cst_13) applies stablehlo.add across dimensions = [0, 1] : (tensor<32x1xf32>, tensor<f32>) -> tensor<f32>
    %166 = stablehlo.divide %165, %cst_12 : tensor<f32>
    %167 = stablehlo.exponential %85 : tensor<32x1x16xf32>
    %168 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<32x1x16xf32>
    %169 = stablehlo.add %168, %85 : tensor<32x1x16xf32>
    %170 = stablehlo.multiply %58, %58 : tensor<32x1x16xf32>
    %171 = stablehlo.broadcast_in_dim %cst_14, dims = [] : (tensor<f32>) -> tensor<32x1x16xf32>
    %172 = stablehlo.multiply %171, %58 : tensor<32x1x16xf32>
    %173 = stablehlo.subtract %169, %170 : tensor<32x1x16xf32>
    %174 = stablehlo.subtract %173, %167 : tensor<32x1x16xf32>
    %175 = stablehlo.reduce(%174 init: %cst_13) applies stablehlo.add across dimensions = [2] : (tensor<32x1x16xf32>, tensor<f32>) -> tensor<32x1xf32>
    %176 = stablehlo.broadcast_in_dim %cst_11, dims = [] : (tensor<f32>) -> tensor<32x1xf32>
    %177 = stablehlo.multiply %176, %175 : tensor<32x1xf32>
    %178 = stablehlo.reduce(%177 init: %cst_13) applies stablehlo.add across dimensions = [0, 1] : (tensor<32x1xf32>, tensor<f32>) -> tensor<f32>
    %179 = stablehlo.divide %178, %cst_12 : tensor<f32>
    %180 = stablehlo.broadcast_in_dim %cst_10, dims = [] : (tensor<f32>) -> tensor<784x512xf32>
    %181 = stablehlo.multiply %arg2, %180 : tensor<784x512xf32>
    %182 = stablehlo.log %181 : tensor<784x512xf32>
    %183 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<784x512xf32>
    %184 = stablehlo.add %183, %182 : tensor<784x512xf32>
    %185 = stablehlo.multiply %arg1, %arg1 : tensor<784x512xf32>
    %186 = stablehlo.broadcast_in_dim %cst_14, dims = [] : (tensor<f32>) -> tensor<784x512xf32>
    %187 = stablehlo.multiply %186, %arg1 : tensor<784x512xf32>
    %188 = stablehlo.subtract %184, %185 : tensor<784x512xf32>
    %189 = stablehlo.subtract %188, %181 : tensor<784x512xf32>
    %190 = stablehlo.reduce(%189 init: %cst_13) applies stablehlo.add across dimensions = [1] : (tensor<784x512xf32>, tensor<f32>) -> tensor<784xf32>
    %191 = stablehlo.broadcast_in_dim %cst_11, dims = [] : (tensor<f32>) -> tensor<784xf32>
    %192 = stablehlo.multiply %191, %190 : tensor<784xf32>
    %193 = stablehlo.reduce(%192 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<784xf32>, tensor<f32>) -> tensor<f32>
    %194 = stablehlo.divide %193, %cst_9 : tensor<f32>
    %195 = stablehlo.broadcast_in_dim %cst_10, dims = [] : (tensor<f32>) -> tensor<512xf32>
    %196 = stablehlo.multiply %arg4, %195 : tensor<512xf32>
    %197 = stablehlo.log %196 : tensor<512xf32>
    %198 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<512xf32>
    %199 = stablehlo.add %198, %197 : tensor<512xf32>
    %200 = stablehlo.multiply %arg3, %arg3 : tensor<512xf32>
    %201 = stablehlo.broadcast_in_dim %cst_14, dims = [] : (tensor<f32>) -> tensor<512xf32>
    %202 = stablehlo.multiply %201, %arg3 : tensor<512xf32>
    %203 = stablehlo.subtract %199, %200 : tensor<512xf32>
    %204 = stablehlo.subtract %203, %196 : tensor<512xf32>
    %205 = stablehlo.reduce(%204 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<512xf32>, tensor<f32>) -> tensor<f32>
    %206 = stablehlo.multiply %cst_11, %205 : tensor<f32>
    %207 = stablehlo.reduce(%206 init: %cst_13) applies stablehlo.add across dimensions = [] : (tensor<f32>, tensor<f32>) -> tensor<f32>
    %208 = stablehlo.divide %207, %cst_15 : tensor<f32>
    %209 = stablehlo.add %194, %208 : tensor<f32>
    %210 = stablehlo.broadcast_in_dim %cst_10, dims = [] : (tensor<f32>) -> tensor<512x16xf32>
    %211 = stablehlo.multiply %arg6, %210 : tensor<512x16xf32>
    %212 = stablehlo.log %211 : tensor<512x16xf32>
    %213 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<512x16xf32>
    %214 = stablehlo.add %213, %212 : tensor<512x16xf32>
    %215 = stablehlo.multiply %arg5, %arg5 : tensor<512x16xf32>
    %216 = stablehlo.broadcast_in_dim %cst_14, dims = [] : (tensor<f32>) -> tensor<512x16xf32>
    %217 = stablehlo.multiply %216, %arg5 : tensor<512x16xf32>
    %218 = stablehlo.subtract %214, %215 : tensor<512x16xf32>
    %219 = stablehlo.subtract %218, %211 : tensor<512x16xf32>
    %220 = stablehlo.reduce(%219 init: %cst_13) applies stablehlo.add across dimensions = [1] : (tensor<512x16xf32>, tensor<f32>) -> tensor<512xf32>
    %221 = stablehlo.broadcast_in_dim %cst_11, dims = [] : (tensor<f32>) -> tensor<512xf32>
    %222 = stablehlo.multiply %221, %220 : tensor<512xf32>
    %223 = stablehlo.reduce(%222 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<512xf32>, tensor<f32>) -> tensor<f32>
    %224 = stablehlo.divide %223, %cst_8 : tensor<f32>
    %225 = stablehlo.add %209, %224 : tensor<f32>
    %226 = stablehlo.broadcast_in_dim %cst_10, dims = [] : (tensor<f32>) -> tensor<16xf32>
    %227 = stablehlo.multiply %arg8, %226 : tensor<16xf32>
    %228 = stablehlo.log %227 : tensor<16xf32>
    %229 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<16xf32>
    %230 = stablehlo.add %229, %228 : tensor<16xf32>
    %231 = stablehlo.multiply %arg7, %arg7 : tensor<16xf32>
    %232 = stablehlo.broadcast_in_dim %cst_14, dims = [] : (tensor<f32>) -> tensor<16xf32>
    %233 = stablehlo.multiply %232, %arg7 : tensor<16xf32>
    %234 = stablehlo.subtract %230, %231 : tensor<16xf32>
    %235 = stablehlo.subtract %234, %227 : tensor<16xf32>
    %236 = stablehlo.reduce(%235 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<16xf32>, tensor<f32>) -> tensor<f32>
    %237 = stablehlo.multiply %cst_11, %236 : tensor<f32>
    %238 = stablehlo.reduce(%237 init: %cst_13) applies stablehlo.add across dimensions = [] : (tensor<f32>, tensor<f32>) -> tensor<f32>
    %239 = stablehlo.divide %238, %cst_15 : tensor<f32>
    %240 = stablehlo.add %225, %239 : tensor<f32>
    %241 = stablehlo.broadcast_in_dim %cst_10, dims = [] : (tensor<f32>) -> tensor<512x16xf32>
    %242 = stablehlo.multiply %arg10, %241 : tensor<512x16xf32>
    %243 = stablehlo.log %242 : tensor<512x16xf32>
    %244 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<512x16xf32>
    %245 = stablehlo.add %244, %243 : tensor<512x16xf32>
    %246 = stablehlo.multiply %arg9, %arg9 : tensor<512x16xf32>
    %247 = stablehlo.broadcast_in_dim %cst_14, dims = [] : (tensor<f32>) -> tensor<512x16xf32>
    %248 = stablehlo.multiply %247, %arg9 : tensor<512x16xf32>
    %249 = stablehlo.subtract %245, %246 : tensor<512x16xf32>
    %250 = stablehlo.subtract %249, %242 : tensor<512x16xf32>
    %251 = stablehlo.reduce(%250 init: %cst_13) applies stablehlo.add across dimensions = [1] : (tensor<512x16xf32>, tensor<f32>) -> tensor<512xf32>
    %252 = stablehlo.broadcast_in_dim %cst_11, dims = [] : (tensor<f32>) -> tensor<512xf32>
    %253 = stablehlo.multiply %252, %251 : tensor<512xf32>
    %254 = stablehlo.reduce(%253 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<512xf32>, tensor<f32>) -> tensor<f32>
    %255 = stablehlo.divide %254, %cst_8 : tensor<f32>
    %256 = stablehlo.add %240, %255 : tensor<f32>
    %257 = stablehlo.broadcast_in_dim %cst_10, dims = [] : (tensor<f32>) -> tensor<16xf32>
    %258 = stablehlo.multiply %arg12, %257 : tensor<16xf32>
    %259 = stablehlo.log %258 : tensor<16xf32>
    %260 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<16xf32>
    %261 = stablehlo.add %260, %259 : tensor<16xf32>
    %262 = stablehlo.multiply %arg11, %arg11 : tensor<16xf32>
    %263 = stablehlo.broadcast_in_dim %cst_14, dims = [] : (tensor<f32>) -> tensor<16xf32>
    %264 = stablehlo.multiply %263, %arg11 : tensor<16xf32>
    %265 = stablehlo.subtract %261, %262 : tensor<16xf32>
    %266 = stablehlo.subtract %265, %258 : tensor<16xf32>
    %267 = stablehlo.reduce(%266 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<16xf32>, tensor<f32>) -> tensor<f32>
    %268 = stablehlo.multiply %cst_11, %267 : tensor<f32>
    %269 = stablehlo.reduce(%268 init: %cst_13) applies stablehlo.add across dimensions = [] : (tensor<f32>, tensor<f32>) -> tensor<f32>
    %270 = stablehlo.divide %269, %cst_15 : tensor<f32>
    %271 = stablehlo.add %256, %270 : tensor<f32>
    %272 = stablehlo.broadcast_in_dim %cst_10, dims = [] : (tensor<f32>) -> tensor<16x512xf32>
    %273 = stablehlo.multiply %arg14, %272 : tensor<16x512xf32>
    %274 = stablehlo.log %273 : tensor<16x512xf32>
    %275 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<16x512xf32>
    %276 = stablehlo.add %275, %274 : tensor<16x512xf32>
    %277 = stablehlo.multiply %arg13, %arg13 : tensor<16x512xf32>
    %278 = stablehlo.broadcast_in_dim %cst_14, dims = [] : (tensor<f32>) -> tensor<16x512xf32>
    %279 = stablehlo.multiply %278, %arg13 : tensor<16x512xf32>
    %280 = stablehlo.subtract %276, %277 : tensor<16x512xf32>
    %281 = stablehlo.subtract %280, %273 : tensor<16x512xf32>
    %282 = stablehlo.reduce(%281 init: %cst_13) applies stablehlo.add across dimensions = [1] : (tensor<16x512xf32>, tensor<f32>) -> tensor<16xf32>
    %283 = stablehlo.broadcast_in_dim %cst_11, dims = [] : (tensor<f32>) -> tensor<16xf32>
    %284 = stablehlo.multiply %283, %282 : tensor<16xf32>
    %285 = stablehlo.reduce(%284 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<16xf32>, tensor<f32>) -> tensor<f32>
    %286 = stablehlo.divide %285, %cst_7 : tensor<f32>
    %287 = stablehlo.add %271, %286 : tensor<f32>
    %288 = stablehlo.broadcast_in_dim %cst_10, dims = [] : (tensor<f32>) -> tensor<512xf32>
    %289 = stablehlo.multiply %arg16, %288 : tensor<512xf32>
    %290 = stablehlo.log %289 : tensor<512xf32>
    %291 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<512xf32>
    %292 = stablehlo.add %291, %290 : tensor<512xf32>
    %293 = stablehlo.multiply %arg15, %arg15 : tensor<512xf32>
    %294 = stablehlo.broadcast_in_dim %cst_14, dims = [] : (tensor<f32>) -> tensor<512xf32>
    %295 = stablehlo.multiply %294, %arg15 : tensor<512xf32>
    %296 = stablehlo.subtract %292, %293 : tensor<512xf32>
    %297 = stablehlo.subtract %296, %289 : tensor<512xf32>
    %298 = stablehlo.reduce(%297 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<512xf32>, tensor<f32>) -> tensor<f32>
    %299 = stablehlo.multiply %cst_11, %298 : tensor<f32>
    %300 = stablehlo.reduce(%299 init: %cst_13) applies stablehlo.add across dimensions = [] : (tensor<f32>, tensor<f32>) -> tensor<f32>
    %301 = stablehlo.divide %300, %cst_15 : tensor<f32>
    %302 = stablehlo.add %287, %301 : tensor<f32>
    %303 = stablehlo.broadcast_in_dim %cst_10, dims = [] : (tensor<f32>) -> tensor<512x784xf32>
    %304 = stablehlo.multiply %arg18, %303 : tensor<512x784xf32>
    %305 = stablehlo.log %304 : tensor<512x784xf32>
    %306 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<512x784xf32>
    %307 = stablehlo.add %306, %305 : tensor<512x784xf32>
    %308 = stablehlo.multiply %arg17, %arg17 : tensor<512x784xf32>
    %309 = stablehlo.broadcast_in_dim %cst_14, dims = [] : (tensor<f32>) -> tensor<512x784xf32>
    %310 = stablehlo.multiply %309, %arg17 : tensor<512x784xf32>
    %311 = stablehlo.subtract %307, %308 : tensor<512x784xf32>
    %312 = stablehlo.subtract %311, %304 : tensor<512x784xf32>
    %313 = stablehlo.reduce(%312 init: %cst_13) applies stablehlo.add across dimensions = [1] : (tensor<512x784xf32>, tensor<f32>) -> tensor<512xf32>
    %314 = stablehlo.broadcast_in_dim %cst_11, dims = [] : (tensor<f32>) -> tensor<512xf32>
    %315 = stablehlo.multiply %314, %313 : tensor<512xf32>
    %316 = stablehlo.reduce(%315 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<512xf32>, tensor<f32>) -> tensor<f32>
    %317 = stablehlo.divide %316, %cst_8 : tensor<f32>
    %318 = stablehlo.add %302, %317 : tensor<f32>
    %319 = stablehlo.broadcast_in_dim %cst_10, dims = [] : (tensor<f32>) -> tensor<784xf32>
    %320 = stablehlo.multiply %arg20, %319 : tensor<784xf32>
    %321 = stablehlo.log %320 : tensor<784xf32>
    %322 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<784xf32>
    %323 = stablehlo.add %322, %321 : tensor<784xf32>
    %324 = stablehlo.multiply %arg19, %arg19 : tensor<784xf32>
    %325 = stablehlo.broadcast_in_dim %cst_14, dims = [] : (tensor<f32>) -> tensor<784xf32>
    %326 = stablehlo.multiply %325, %arg19 : tensor<784xf32>
    %327 = stablehlo.subtract %323, %324 : tensor<784xf32>
    %328 = stablehlo.subtract %327, %320 : tensor<784xf32>
    %329 = stablehlo.reduce(%328 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<784xf32>, tensor<f32>) -> tensor<f32>
    %330 = stablehlo.multiply %cst_11, %329 : tensor<f32>
    %331 = stablehlo.reduce(%330 init: %cst_13) applies stablehlo.add across dimensions = [] : (tensor<f32>, tensor<f32>) -> tensor<f32>
    %332 = stablehlo.divide %331, %cst_15 : tensor<f32>
    %333 = stablehlo.add %318, %332 : tensor<f32>
    %334 = stablehlo.add %166, %179 : tensor<f32>
    %335 = stablehlo.add %334, %333 : tensor<f32>
    %336 = stablehlo.divide %cst_15, %cst_15 : tensor<f32>
    %337 = stablehlo.multiply %cst_11, %336 : tensor<f32>
    %338 = stablehlo.broadcast_in_dim %337, dims = [] : (tensor<f32>) -> tensor<784xf32>
    %339 = stablehlo.negate %338 : tensor<784xf32>
    %340 = stablehlo.negate %338 : tensor<784xf32>
    %341 = stablehlo.multiply %340, %326 : tensor<784xf32>
    %342 = stablehlo.divide %338, %320 : tensor<784xf32>
    %343 = stablehlo.add %339, %342 : tensor<784xf32>
    %344 = stablehlo.broadcast_in_dim %cst_10, dims = [] : (tensor<f32>) -> tensor<784xf32>
    %345 = stablehlo.multiply %343, %344 : tensor<784xf32>
    %346 = stablehlo.divide %cst_15, %cst_8 : tensor<f32>
    %347 = stablehlo.broadcast_in_dim %346, dims = [] : (tensor<f32>) -> tensor<512xf32>
    %348 = stablehlo.broadcast_in_dim %cst_11, dims = [] : (tensor<f32>) -> tensor<512xf32>
    %349 = stablehlo.multiply %348, %347 : tensor<512xf32>
    %350 = stablehlo.broadcast_in_dim %349, dims = [0] : (tensor<512xf32>) -> tensor<512x784xf32>
    %351 = stablehlo.negate %350 : tensor<512x784xf32>
    %352 = stablehlo.negate %350 : tensor<512x784xf32>
    %353 = stablehlo.multiply %352, %310 : tensor<512x784xf32>
    %354 = stablehlo.divide %350, %304 : tensor<512x784xf32>
    %355 = stablehlo.add %351, %354 : tensor<512x784xf32>
    %356 = stablehlo.broadcast_in_dim %cst_10, dims = [] : (tensor<f32>) -> tensor<512x784xf32>
    %357 = stablehlo.multiply %355, %356 : tensor<512x784xf32>
    %358 = stablehlo.divide %cst_15, %cst_15 : tensor<f32>
    %359 = stablehlo.multiply %cst_11, %358 : tensor<f32>
    %360 = stablehlo.broadcast_in_dim %359, dims = [] : (tensor<f32>) -> tensor<512xf32>
    %361 = stablehlo.negate %360 : tensor<512xf32>
    %362 = stablehlo.negate %360 : tensor<512xf32>
    %363 = stablehlo.multiply %362, %295 : tensor<512xf32>
    %364 = stablehlo.divide %360, %289 : tensor<512xf32>
    %365 = stablehlo.add %361, %364 : tensor<512xf32>
    %366 = stablehlo.broadcast_in_dim %cst_10, dims = [] : (tensor<f32>) -> tensor<512xf32>
    %367 = stablehlo.multiply %365, %366 : tensor<512xf32>
    %368 = stablehlo.divide %cst_15, %cst_7 : tensor<f32>
    %369 = stablehlo.broadcast_in_dim %368, dims = [] : (tensor<f32>) -> tensor<16xf32>
    %370 = stablehlo.broadcast_in_dim %cst_11, dims = [] : (tensor<f32>) -> tensor<16xf32>
    %371 = stablehlo.multiply %370, %369 : tensor<16xf32>
    %372 = stablehlo.broadcast_in_dim %371, dims = [0] : (tensor<16xf32>) -> tensor<16x512xf32>
    %373 = stablehlo.negate %372 : tensor<16x512xf32>
    %374 = stablehlo.negate %372 : tensor<16x512xf32>
    %375 = stablehlo.multiply %374, %279 : tensor<16x512xf32>
    %376 = stablehlo.divide %372, %273 : tensor<16x512xf32>
    %377 = stablehlo.add %373, %376 : tensor<16x512xf32>
    %378 = stablehlo.broadcast_in_dim %cst_10, dims = [] : (tensor<f32>) -> tensor<16x512xf32>
    %379 = stablehlo.multiply %377, %378 : tensor<16x512xf32>
    %380 = stablehlo.divide %cst_15, %cst_15 : tensor<f32>
    %381 = stablehlo.multiply %cst_11, %380 : tensor<f32>
    %382 = stablehlo.broadcast_in_dim %381, dims = [] : (tensor<f32>) -> tensor<16xf32>
    %383 = stablehlo.negate %382 : tensor<16xf32>
    %384 = stablehlo.negate %382 : tensor<16xf32>
    %385 = stablehlo.multiply %384, %264 : tensor<16xf32>
    %386 = stablehlo.divide %382, %258 : tensor<16xf32>
    %387 = stablehlo.add %383, %386 : tensor<16xf32>
    %388 = stablehlo.broadcast_in_dim %cst_10, dims = [] : (tensor<f32>) -> tensor<16xf32>
    %389 = stablehlo.multiply %387, %388 : tensor<16xf32>
    %390 = stablehlo.divide %cst_15, %cst_8 : tensor<f32>
    %391 = stablehlo.broadcast_in_dim %390, dims = [] : (tensor<f32>) -> tensor<512xf32>
    %392 = stablehlo.broadcast_in_dim %cst_11, dims = [] : (tensor<f32>) -> tensor<512xf32>
    %393 = stablehlo.multiply %392, %391 : tensor<512xf32>
    %394 = stablehlo.broadcast_in_dim %393, dims = [0] : (tensor<512xf32>) -> tensor<512x16xf32>
    %395 = stablehlo.negate %394 : tensor<512x16xf32>
    %396 = stablehlo.negate %394 : tensor<512x16xf32>
    %397 = stablehlo.multiply %396, %248 : tensor<512x16xf32>
    %398 = stablehlo.divide %394, %242 : tensor<512x16xf32>
    %399 = stablehlo.add %395, %398 : tensor<512x16xf32>
    %400 = stablehlo.broadcast_in_dim %cst_10, dims = [] : (tensor<f32>) -> tensor<512x16xf32>
    %401 = stablehlo.multiply %399, %400 : tensor<512x16xf32>
    %402 = stablehlo.divide %cst_15, %cst_15 : tensor<f32>
    %403 = stablehlo.multiply %cst_11, %402 : tensor<f32>
    %404 = stablehlo.broadcast_in_dim %403, dims = [] : (tensor<f32>) -> tensor<16xf32>
    %405 = stablehlo.negate %404 : tensor<16xf32>
    %406 = stablehlo.negate %404 : tensor<16xf32>
    %407 = stablehlo.multiply %406, %233 : tensor<16xf32>
    %408 = stablehlo.divide %404, %227 : tensor<16xf32>
    %409 = stablehlo.add %405, %408 : tensor<16xf32>
    %410 = stablehlo.broadcast_in_dim %cst_10, dims = [] : (tensor<f32>) -> tensor<16xf32>
    %411 = stablehlo.multiply %409, %410 : tensor<16xf32>
    %412 = stablehlo.divide %cst_15, %cst_8 : tensor<f32>
    %413 = stablehlo.broadcast_in_dim %412, dims = [] : (tensor<f32>) -> tensor<512xf32>
    %414 = stablehlo.broadcast_in_dim %cst_11, dims = [] : (tensor<f32>) -> tensor<512xf32>
    %415 = stablehlo.multiply %414, %413 : tensor<512xf32>
    %416 = stablehlo.broadcast_in_dim %415, dims = [0] : (tensor<512xf32>) -> tensor<512x16xf32>
    %417 = stablehlo.negate %416 : tensor<512x16xf32>
    %418 = stablehlo.negate %416 : tensor<512x16xf32>
    %419 = stablehlo.multiply %418, %217 : tensor<512x16xf32>
    %420 = stablehlo.divide %416, %211 : tensor<512x16xf32>
    %421 = stablehlo.add %417, %420 : tensor<512x16xf32>
    %422 = stablehlo.broadcast_in_dim %cst_10, dims = [] : (tensor<f32>) -> tensor<512x16xf32>
    %423 = stablehlo.multiply %421, %422 : tensor<512x16xf32>
    %424 = stablehlo.divide %cst_15, %cst_15 : tensor<f32>
    %425 = stablehlo.multiply %cst_11, %424 : tensor<f32>
    %426 = stablehlo.broadcast_in_dim %425, dims = [] : (tensor<f32>) -> tensor<512xf32>
    %427 = stablehlo.negate %426 : tensor<512xf32>
    %428 = stablehlo.negate %426 : tensor<512xf32>
    %429 = stablehlo.multiply %428, %202 : tensor<512xf32>
    %430 = stablehlo.divide %426, %196 : tensor<512xf32>
    %431 = stablehlo.add %427, %430 : tensor<512xf32>
    %432 = stablehlo.broadcast_in_dim %cst_10, dims = [] : (tensor<f32>) -> tensor<512xf32>
    %433 = stablehlo.multiply %431, %432 : tensor<512xf32>
    %434 = stablehlo.divide %cst_15, %cst_9 : tensor<f32>
    %435 = stablehlo.broadcast_in_dim %434, dims = [] : (tensor<f32>) -> tensor<784xf32>
    %436 = stablehlo.broadcast_in_dim %cst_11, dims = [] : (tensor<f32>) -> tensor<784xf32>
    %437 = stablehlo.multiply %436, %435 : tensor<784xf32>
    %438 = stablehlo.broadcast_in_dim %437, dims = [0] : (tensor<784xf32>) -> tensor<784x512xf32>
    %439 = stablehlo.negate %438 : tensor<784x512xf32>
    %440 = stablehlo.negate %438 : tensor<784x512xf32>
    %441 = stablehlo.multiply %440, %187 : tensor<784x512xf32>
    %442 = stablehlo.divide %438, %181 : tensor<784x512xf32>
    %443 = stablehlo.add %439, %442 : tensor<784x512xf32>
    %444 = stablehlo.broadcast_in_dim %cst_10, dims = [] : (tensor<f32>) -> tensor<784x512xf32>
    %445 = stablehlo.multiply %443, %444 : tensor<784x512xf32>
    %446 = stablehlo.divide %cst_15, %cst_12 : tensor<f32>
    %447 = stablehlo.broadcast_in_dim %446, dims = [] : (tensor<f32>) -> tensor<32x1xf32>
    %448 = stablehlo.broadcast_in_dim %cst_11, dims = [] : (tensor<f32>) -> tensor<32x1xf32>
    %449 = stablehlo.multiply %448, %447 : tensor<32x1xf32>
    %450 = stablehlo.broadcast_in_dim %449, dims = [0, 1] : (tensor<32x1xf32>) -> tensor<32x1x16xf32>
    %451 = stablehlo.negate %450 : tensor<32x1x16xf32>
    %452 = stablehlo.multiply %451, %167 : tensor<32x1x16xf32>
    %453 = stablehlo.negate %450 : tensor<32x1x16xf32>
    %454 = stablehlo.multiply %453, %172 : tensor<32x1x16xf32>
    %455 = stablehlo.add %452, %450 : tensor<32x1x16xf32>
    %456 = stablehlo.divide %cst_15, %cst_12 : tensor<f32>
    %457 = stablehlo.broadcast_in_dim %456, dims = [] : (tensor<f32>) -> tensor<32x1xf32>
    %458 = stablehlo.broadcast_in_dim %457, dims = [0, 1] : (tensor<32x1xf32>) -> tensor<32x1x784xf32>
    %459 = stablehlo.multiply %458, %163 : tensor<32x1x784xf32>
    %460 = stablehlo.negate %459 : tensor<32x1x784xf32>
    %461 = stablehlo.multiply %460, %158 : tensor<32x1x784xf32>
    %462 = stablehlo.broadcast_in_dim %cst_15, dims = [] : (tensor<f32>) -> tensor<32x1x784xf32>
    %463 = stablehlo.multiply %461, %462 : tensor<32x1x784xf32>
    %464 = stablehlo.negate %463 : tensor<32x1x784xf32>
    %465 = stablehlo.multiply %464, %151 : tensor<32x1x784xf32>
    %466 = stablehlo.negate %465 : tensor<32x1x784xf32>
    %467 = stablehlo.reduce(%466 init: %cst_13) applies stablehlo.add across dimensions = [1] : (tensor<32x1x784xf32>, tensor<f32>) -> tensor<32x784xf32>
    %468 = stablehlo.reduce(%467 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<32x784xf32>, tensor<f32>) -> tensor<784xf32>
    %469 = stablehlo.reshape %468 : (tensor<784xf32>) -> tensor<1x784xf32>
    %470 = stablehlo.reduce(%469 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<1x784xf32>, tensor<f32>) -> tensor<784xf32>
    %471 = stablehlo.add %341, %470 : tensor<784xf32>
    %472 = stablehlo.multiply %467, %140 : tensor<32x784xf32>
    %473 = stablehlo.reduce(%472 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<32x784xf32>, tensor<f32>) -> tensor<784xf32>
    %474 = stablehlo.reshape %473 : (tensor<784xf32>) -> tensor<1x784xf32>
    %475 = stablehlo.reduce(%474 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<1x784xf32>, tensor<f32>) -> tensor<784xf32>
    %476 = stablehlo.add %345, %475 : tensor<784xf32>
    %477 = stablehlo.dot_general %466, %122, batching_dims = [0] x [0], contracting_dims = [1] x [1] : (tensor<32x1x784xf32>, tensor<32x1x512xf32>) -> tensor<32x784x512xf32>
    %478 = stablehlo.transpose %477, dims = [0, 2, 1] : (tensor<32x784x512xf32>) -> tensor<32x512x784xf32>
    %479 = stablehlo.dot_general %466, %136, batching_dims = [0] x [0], contracting_dims = [2] x [2] : (tensor<32x1x784xf32>, tensor<32x512x784xf32>) -> tensor<32x1x512xf32>
    %480 = stablehlo.reduce(%478 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<32x512x784xf32>, tensor<f32>) -> tensor<512x784xf32>
    %481 = stablehlo.reshape %480 : (tensor<512x784xf32>) -> tensor<1x512x784xf32>
    %482 = stablehlo.reduce(%481 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<1x512x784xf32>, tensor<f32>) -> tensor<512x784xf32>
    %483 = stablehlo.add %353, %482 : tensor<512x784xf32>
    %484 = stablehlo.multiply %478, %130 : tensor<32x512x784xf32>
    %485 = stablehlo.reduce(%484 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<32x512x784xf32>, tensor<f32>) -> tensor<512x784xf32>
    %486 = stablehlo.reshape %485 : (tensor<512x784xf32>) -> tensor<1x512x784xf32>
    %487 = stablehlo.reduce(%486 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<1x512x784xf32>, tensor<f32>) -> tensor<512x784xf32>
    %488 = stablehlo.add %357, %487 : tensor<512x784xf32>
    %489 = stablehlo.multiply %479, %124 : tensor<32x1x512xf32>
    %490 = stablehlo.multiply %489, %122 : tensor<32x1x512xf32>
    %491 = stablehlo.add %489, %490 : tensor<32x1x512xf32>
    %492 = stablehlo.reduce(%491 init: %cst_13) applies stablehlo.add across dimensions = [1] : (tensor<32x1x512xf32>, tensor<f32>) -> tensor<32x512xf32>
    %493 = stablehlo.reduce(%492 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<32x512xf32>, tensor<f32>) -> tensor<512xf32>
    %494 = stablehlo.reshape %493 : (tensor<512xf32>) -> tensor<1x512xf32>
    %495 = stablehlo.reduce(%494 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<1x512xf32>, tensor<f32>) -> tensor<512xf32>
    %496 = stablehlo.add %363, %495 : tensor<512xf32>
    %497 = stablehlo.multiply %492, %112 : tensor<32x512xf32>
    %498 = stablehlo.reduce(%497 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<32x512xf32>, tensor<f32>) -> tensor<512xf32>
    %499 = stablehlo.reshape %498 : (tensor<512xf32>) -> tensor<1x512xf32>
    %500 = stablehlo.reduce(%499 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<1x512xf32>, tensor<f32>) -> tensor<512xf32>
    %501 = stablehlo.add %367, %500 : tensor<512xf32>
    %502 = stablehlo.dot_general %491, %94, batching_dims = [0] x [0], contracting_dims = [1] x [1] : (tensor<32x1x512xf32>, tensor<32x1x16xf32>) -> tensor<32x512x16xf32>
    %503 = stablehlo.transpose %502, dims = [0, 2, 1] : (tensor<32x512x16xf32>) -> tensor<32x16x512xf32>
    %504 = stablehlo.dot_general %491, %106, batching_dims = [0] x [0], contracting_dims = [2] x [2] : (tensor<32x1x512xf32>, tensor<32x16x512xf32>) -> tensor<32x1x16xf32>
    %505 = stablehlo.reduce(%503 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<32x16x512xf32>, tensor<f32>) -> tensor<16x512xf32>
    %506 = stablehlo.reshape %505 : (tensor<16x512xf32>) -> tensor<1x16x512xf32>
    %507 = stablehlo.reduce(%506 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<1x16x512xf32>, tensor<f32>) -> tensor<16x512xf32>
    %508 = stablehlo.add %375, %507 : tensor<16x512xf32>
    %509 = stablehlo.multiply %503, %100 : tensor<32x16x512xf32>
    %510 = stablehlo.reduce(%509 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<32x16x512xf32>, tensor<f32>) -> tensor<16x512xf32>
    %511 = stablehlo.reshape %510 : (tensor<16x512xf32>) -> tensor<1x16x512xf32>
    %512 = stablehlo.reduce(%511 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<1x16x512xf32>, tensor<f32>) -> tensor<16x512xf32>
    %513 = stablehlo.add %379, %512 : tensor<16x512xf32>
    %514 = stablehlo.add %454, %504 : tensor<32x1x16xf32>
    %515 = stablehlo.multiply %504, %92 : tensor<32x1x16xf32>
    %516 = stablehlo.multiply %515, %86 : tensor<32x1x16xf32>
    %517 = stablehlo.add %455, %516 : tensor<32x1x16xf32>
    %518 = stablehlo.reduce(%517 init: %cst_13) applies stablehlo.add across dimensions = [1] : (tensor<32x1x16xf32>, tensor<f32>) -> tensor<32x16xf32>
    %519 = stablehlo.reduce(%518 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<32x16xf32>, tensor<f32>) -> tensor<16xf32>
    %520 = stablehlo.reshape %519 : (tensor<16xf32>) -> tensor<1x16xf32>
    %521 = stablehlo.reduce(%520 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<1x16xf32>, tensor<f32>) -> tensor<16xf32>
    %522 = stablehlo.add %385, %521 : tensor<16xf32>
    %523 = stablehlo.multiply %518, %76 : tensor<32x16xf32>
    %524 = stablehlo.reduce(%523 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<32x16xf32>, tensor<f32>) -> tensor<16xf32>
    %525 = stablehlo.reshape %524 : (tensor<16xf32>) -> tensor<1x16xf32>
    %526 = stablehlo.reduce(%525 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<1x16xf32>, tensor<f32>) -> tensor<16xf32>
    %527 = stablehlo.add %389, %526 : tensor<16xf32>
    %528 = stablehlo.dot_general %517, %29, batching_dims = [0] x [0], contracting_dims = [1] x [1] : (tensor<32x1x16xf32>, tensor<32x1x512xf32>) -> tensor<32x16x512xf32>
    %529 = stablehlo.transpose %528, dims = [0, 2, 1] : (tensor<32x16x512xf32>) -> tensor<32x512x16xf32>
    %530 = stablehlo.dot_general %517, %70, batching_dims = [0] x [0], contracting_dims = [2] x [2] : (tensor<32x1x16xf32>, tensor<32x512x16xf32>) -> tensor<32x1x512xf32>
    %531 = stablehlo.reduce(%529 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<32x512x16xf32>, tensor<f32>) -> tensor<512x16xf32>
    %532 = stablehlo.reshape %531 : (tensor<512x16xf32>) -> tensor<1x512x16xf32>
    %533 = stablehlo.reduce(%532 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<1x512x16xf32>, tensor<f32>) -> tensor<512x16xf32>
    %534 = stablehlo.add %397, %533 : tensor<512x16xf32>
    %535 = stablehlo.multiply %529, %64 : tensor<32x512x16xf32>
    %536 = stablehlo.reduce(%535 init: %cst_13) applies stablehlo.add across dimensions = [0] : (tensor<32x512x16xf32>, tensor<f32>) -> tensor<512x16xf32>
    %537 = stablehlo.reshape %536 : (tensor<512x16xf32>) -> tensor<1x512x16xf32>
